[
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-alabama",
    "name":"Do I need to provide ID when I register to vote in Alabama",
    "text":"There are no special ID requirements for first-time voters since all Alabama voters need to provide ID when voting in person or by absentee ballot.",
    "categories":["56e8413c90336026d871854f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-alabama",
    "name":"Do I need to provide ID when I vote by absentee ballot in Alabama",
    "text":"All absentee voters must include a copy of their ID with their absentee ballot. Acceptable forms of voter ID include: Government-issued photo ID; Employee photo ID; Alabama college, university photo ID technical or professional school photo ID; utility bill, bank statement, government paycheck, or paycheck with voter's name and address; Valid ID card (authorized by law) issued by the State of or by any of the other 49 states or issued by the US government; US passport; Alabama hunting or fishing license; Alabama pistol/revolver permit; Valid pilot's license; Valid US military ID; Birth certificate; Social Security card; Naturalization document; Court record of adoption; Court record of name change; Valid Medicaid or Medicare card; Valid electronic benefits transfer card; Government document that shows the name and address of the voter.",
    "categories":["56e8413c90336026d871854f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i've-missed-the-absentee-ballot-application-deadline-in-alabama-is-there-anything-i-can-do",
    "name":"I've missed the absentee ballot application deadline in Alabama. Is there anything I can do",
    "text":"In most cases, no. There are two conditions, however, under which you can apply for an Emergency Absentee Ballot:<li>You are required by an employer under unforeseen circumstances to be out of the county on election day for an emergency business trip</li><li>You have a medical emergency requiring treatment from a licensed physician</li>You are required by an employer under unforeseen circumstances to be out of the county on election day for an emergency business tripYou have a medical emergency requiring treatment from a licensed physicianIf you face either of these situations, use the <a href='/files/voter_forms/Alabama_absentee_emergency.pdf'>Alabama Application for an Emergency Absentee Ballot</a>. The business emergency application contains an affidavit acknowledging that the voter was not aware of the out-of-county business trip prior to the normal absentee ballot deadline. The medical emergency application requires that the attending physician describe and certify the circumstances as constituting an emergency. Mail or hand-deliver your completed application to the Absentee Election Manager in care of the <a href='http://www.sos.state.al.us/vb/election/all.aspxtrgtoffice=Circuit%20Clerk'>Circuit Clerk</a> for your county.Emergency Absentee Ballot Applications can be submitted after the absentee ballot application deadline but no later than 5 PM on the day before the election.",
    "categories":["56e8413c90336026d871854f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-alabama",
    "name":"Can I vote in person before the election in Alabama",
    "text":"No. Alabama does not allow in-person early voting.",
    "categories":["56e8413c90336026d871854f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-hawaii",
    "name":"Do I need to provide ID when I register to vote in Hawaii",
    "text":"If you are a first time voter you must include a copy of your ID with your voter registration form. If you forget, you'll need to provide ID the first time you vote in person or by absentee ballot. Acceptable forms of ID include a current and valid photo identification that shows your name (driver's license, US passport, student ID, military ID, work ID, tribal ID, etc) OR a current utility bill, bank statement, paycheck, government check or other government document that shows your name and address.first time voternamename and address",
    "categories":["56e8414290336026d8718556"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-hawaii",
    "name":"Do I need to provide ID when I vote by absentee ballot in Hawaii",
    "text":"You do not need to provide ID if you've already voted in Hawaii at least once. If you are a first time voter and you did not include a copy of your ID with your voter registration form, you must include it with your absentee ballot application or with your voted absentee ballot. Acceptable forms of ID include a current and valid photo identification that shows your name (driver's license, US passport, student ID, military ID, work ID, tribal ID, etc) OR a current utility bill, bank statement, paycheck, government check or other government document that shows your name and address.namename and address",
    "categories":["56e8414290336026d8718556"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-hawaii",
    "name":"Can I vote by absentee ballot on a permanent basis in Hawaii",
    "text":"YES. Hawaii allows all registered voters to add themselves to the Permanent Absentee Voter List. Use the <a href='/files/voter_forms/Hawaii_voterreg_english.pdf'>Hawaii Voter Registration &amp; Permanent Absentee Application</a> and mail the completed application to your County Clerk. The address is on the form.You will remain on the list of Permanent Absentee Voters unless you fail to return a voter ballot by 6:00 p.m. election day in both the primary and general election, register to vote in another jurisdiction, or fail to keep your voter registration updated.",
    "categories":["56e8414290336026d8718556"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-hawaii",
    "name":"Can I vote in person before the election in Hawaii",
    "text":"Yes. Check out our <a href='/early_voting_rules#hawaii'>Early Voting</a> page for details.",
    "categories":["56e8414290336026d8718556"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-massachusetts",
    "name":"Do I need to provide ID when I vote by absentee ballot in Massachusetts",
    "text":"You do not need to provide ID if you've already voted in Massachusetts at least once. If you are a first time Massachusetts and you did not include a copy of your ID with your voter registration form, you must include a copy with your absentee ballot application. Acceptable identification includes: a current and valid photo identification and Massachusetts address OR a current utility bill, bank statement, paycheck, government check, or other government document that shows your name and address.first time copy",
    "categories":["56e84147c697911471461f76"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-massachusetts",
    "name":"Can I vote in person before the election in Massachusetts",
    "text":"Yes. Check out our <a href='/early_voting_rules#massachusetts'>Early Voting</a> page for details.",
    "categories":["56e84147c697911471461f76"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-iregister-to-vote-in-new-mexico",
    "name":"Do I need to provide IDwhen Iregister to vote in New Mexico",
    "text":"Yes. If you register by mail, you must include a <strong>copy</strong> of your identification with your voter registration application. If you forget, you'll need to provide ID the first time you vote in person or by absentee ballot.by mailcopyAcceptable forms of ID include:a current and valid photo identification with or without an address (the address does not need to match the one at which you registered to vote) OR a utility bill, bank statement, government check, paycheck, student identification card or other government document, including identification issued by an Indian nation, tribe or pueblo, that shows your name and address (the address does not need to match the one at which you're registering to vote).",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-new-mexico",
    "name":"Do I need to provide IDwhen I vote by absentee ballot in New Mexico",
    "text":"You do not need to include ID if you've already voted in New Mexico at least once. If you are a first-time voter and you forgot to include copies of your ID with your registration form, include them with your absentee ballot application.<strong>First-time voters who are voting absentee:</strong> If you don't meet the voter ID requirements when you register to vote, you'll be notified by mail and you will need to provide a copy of your identification with your absentee ballot.Acceptable forms of ID include: a current and valid photo identification with or without an address (the address does not need to match the one at which you registered to vote) OR a utility bill, bank statement, government check, paycheck, student identification card or other government document, including identification issued by an Indian nation, tribe or pueblo, that shows your name and address (the address does not need to match the one at which you're registering to vote).First-time voters who are voting absentee:",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-change-my-mind-after-ireceive-my-absentee-ballot-and-vote-in-person-on-election-day-in-new-mexico",
    "name":"Can I change my mind after Ireceive my absentee ballot and vote in person on election day in New Mexico",
    "text":"No. Once you receive your absentee ballot, you cannot change your mind and vote in person on election day.However, if you applied but never received your absentee ballot, you can go to your polling place and vote. You will be required to sign a sworn statement, under penalty of perjury, that you did not receive your ballot.",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-new-mexico",
    "name":"Can I vote in person before the election in New Mexico",
    "text":"Yes. Check out our <a href='/early_voting_rules#new_mexico'>Early Voting</a> page for details.",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-south-dakota",
    "name":"Do I need to provide IDwhen I vote by absentee ballot in South Dakota",
    "text":"Your absentee ballot application must be notarized or witnessed by an official who can administer an oath.As an alternative to notariziation, you can send a photocopy of a valid form of identification with their absentee ballot application.Acceptable forms of ID: A South Dakota driver۪s license or nondriver identification card; A passport or other picture ID issued by the United States government; a tribal photo ID; OR a current student photo ID issued by a South Dakota high school or postsecondary education institution.",
    "categories":["56e84151c697911471461f7e"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-south-dakota",
    "name":"Can I vote in person before the election in South Dakota",
    "text":"Yes. Check out our <a href='/early_voting_rules#south_dakota'>Early Voting</a> page for details.",
    "categories":["56e84151c697911471461f7e"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-alaska",
    "name":"Do I need to provide ID when I register to vote in Alaska",
    "text":"First-time Alaska voters must verify their identity when registering to vote OR when voting for the first time (either in person or by absentee ballot). You can verify your identity by submitting a copy of one of the following with your voter registration form:current and valid photo identification; driver۪s license; passport; state identification card; birth certificate; hunting and Fishing license.If you register to vote from outside of Alaska you must also submit proof of your Alaska residency with your voter registration form. You can provide a copy of your current Alaska driver's license, Alaska hunting or fishing license; student loan or college tuition documents showing Alaska as your state of residence; proof of employment in Alaska; or military leave and earnings statement that identifies Alaska as the state of legal residence. Proof of your Alaska residency must be in your own name.If you do not provide proof of Alaska residency, your application(s) will not be processed. If you do not provide proof of Alaska residency, your application(s) will not be processed. ",
    "categories":["56e8413d90336026d8718550"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-alaska",
    "name":"Do I need to provide ID when I vote by absentee ballot in Alaska",
    "text":"First time Alaska voters need to verify their identity before voting by absentee ballot. You can verify your identity by submitting a copy of one of the following with your voter registration form:current and valid photo identification; driver۪s license; passport; state identification card; birth certificate; hunting and Fishing license.You'll also need to provide proof of Alaska residency if you apply for an absentee ballot from outside of Alaska. You can provide a copy of your current Alaska driver's license, Alaska hunting or fishing license; student loan or college tuition documents showing Alaska as your state of residence; proof of employment in Alaska; or military leave and earnings statement that identifies Alaska as the state of legal residence. Proof of your Alaska residency must be in your own name. If you do not provide proof of Alaska residency, your application(s) will not be processed. If you do not provide proof of Alaska residency, your application(s) will not be processed. ",
    "categories":["56e8413d90336026d8718550"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"what-if-i'm-in-a-remote-location-and-want-to-make-sure-my-alaska-absentee-ballot-gets-delivered-in-time",
    "name":"What if I'm in a remote location and want to make sure my Alaska absentee ballot gets delivered in time",
    "text":"For Alaska voters who are located in areas where mail service may be slow (for example, remote areas of Alaska), Alaska provides a special advance ballot to allow additional time to cast a ballot. This is a blank ballot with spaces for the voter to write in the names of candidates and/or issues. This ballot is mailed beginning 60 days through 28 days before Election Day.In addition to the special advance ballot, voters are mailed the official ballot beginning approximately three weeks before Election Day. Voters are encouraged to vote and return both ballots. If both ballots are returned in time, only the official ballot will be counted.You can request a special advance ballot by checking the appropriate box on your <a href='/files/voter_forms/Alaska_absentee.pdf'>Alaska Absentee Ballot Application</a>.",
    "categories":["56e8413d90336026d8718550"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-alaska",
    "name":"Can I vote in person before the election in Alaska",
    "text":"Yes. Check out our <a href='/early_voting_rules#alaska'>Early Voting</a> page for details.",
    "categories":["56e8413d90336026d8718550"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-idaho",
    "name":"Do I need to provide ID when I register to vote in Idaho",
    "text":"If you are registering for the first-time in Idaho, and you register by mail, then you must submit a copy of a current and valid photo identification or a current utility bill, bank statement, government check, paycheck, or government document that shows your name and Idaho address with your voter registration application. If you do not submit this identification, then you will be required to provide it the first time you vote in person or by absentee ballot.",
    "categories":["56e84142c697911471461f73"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-idaho",
    "name":"Do I need to provide ID when I vote by absentee ballot in Idaho",
    "text":"You do not need to submit ID if you've already voted in Idaho at least once. If you are a first-time Idaho voter and you did not submit a copy of your ID with your voter registration form, then you must provide a copy of your ID with your absentee ballot application. You may submit a copy of a current and valid photo identification, OR a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and Idaho address.",
    "categories":["56e84142c697911471461f73"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-idaho",
    "name":"Can I vote in person before the election in Idaho",
    "text":"Yes, Iadho allows in-person absentee voting. Check out our <a href='/early_voting_rules#idaho'>Early Voting</a> page for details.",
    "categories":["56e84142c697911471461f73"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-michigan",
    "name":"Do I need to provide ID when I register to vote in Michigan",
    "text":"You must include your Michigan driver's license number or your Michigan state ID card number on your voter registration form. If you don't have either of these numbers, you'll need to include a copy of your ID with your voter registration form. Acceptable forms of ID include: a COPY of a current and valid photo identification that shows your name and Michigan OR a copy of a paycheck, utility bill, bank statement or government document that shows your name and Michigan address.NOTE: All Michigan voters must show photo ID when voting at the polls. It's best to show your Michigan driver's license or Michigan non-drivers ID card. If you don't have either of those documents, you can show a driver's license or personal ID card from another state, a US passport, a military ID, a student ID, or a tribal ID card. Your ID does not need to show your Michigan address.",
    "categories":["56e8414890336026d871855d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-am-a-first-time-michigan-vote-can-i-vote-by-absentee-ballot",
    "name":"I am a first-time Michigan voter. Can I vote by absentee ballot",
    "text":"First-time voters who register by mail must vote in person the first time they vote. You can get around this restriction by requesting your absentee ballot in person from your <a href='https://webapps.sos.state.mi.us/mi-vote/clerksearch.aspx'>local clerk</a> and showing your ID at that time. This restriction does not apply to overseas voters, voters who are handicapped or voters who are 60 years of age or older.",
    "categories":["56e8414890336026d871855d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-michigan",
    "name":"Do I need to provide ID when I vote by absentee ballot in Michigan",
    "text":"No. You can't vote by absentee ballot in Michigan at all if you haven't already met the various voter ID requirements, so only properly identied voters can vote by absentee ballot. ",
    "categories":["56e8414890336026d871855d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis",
    "name":"Can I vote by absentee ballot on a permanent basis",
    "text":"Sort of. Michigan allows voters to place themselves on a 'Permanent Absentee Voter List.' Once you're on list, you'll automatically receive an <strong>Absentee Voter Application</strong> before every election. You'll still need to return the absentee ballot application to your local clerk - and you'll still need to indicate a valid reason for applying for an absentee ballot - before they'll mail you an actual absentee ballot. If you think that you'll regularly need an absentee ballot, you should absolutely add yourself to this list. Contact your <a href='https://webapps.sos.state.mi.us/mi-vote/clerksearch.aspx'>local clerk</a> to learn more..Absentee Voter Application",
    "categories":["56e8414890336026d871855d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"ineed-an-emergency-absentee-ballot-in-michigan-what-can-i-do",
    "name":"Ineed an emergency absentee ballot in Michigan. What can I do",
    "text":"You can apply for an Emergency Absentee Ballot if you have become physically disabled or if a family death or illness requires you to leave your community for the entire time the polls are open on election day. Requests for Emergency Absentee Ballots must be submitted after the deadline for applying for a regular absentee ballot but before 4 p.m. on election day. Contact your <a href='https://webapps.sos.state.mi.us/mi-vote/clerksearch.aspx'>local clerk</a> to obtain an Emergency Absentee Ballot. Emergency Absentee Ballots must be returned to the clerk's office by 8 p.m. on election day.afterbefore",
    "categories":["56e8414890336026d871855d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-michigan",
    "name":"Can I vote in person before the election in Michigan",
    "text":"No, Michigan does not allow in-person early voting.",
    "categories":["56e8414890336026d871855d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-new-york-absentee-ballot",
    "name":"Do I need to provide IDwhen I apply for my New York absentee ballot",
    "text":"You do not need to provide ID if you've already voted in New York at least once. If you're voting in New York for the first time and you did not meet the ID requirements when you registered (see above), you must include a copy of your ID with your absentee ballot application. Acceptable forms of ID include: a copy of a current and valid photo ID that shows your name OR a copy of a current utility bill, bank statement, government check or some other government document that shows your name and New York address.",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-missed-the-deadline-to-apply-for-a-new-york-absentee-ballot-but-i-am-not-able-to-go-to-the-polls-on-election-day-is-there-anything-I can-do",
    "name":"I missed the deadline to apply for a New York absentee ballot, but I am not able to go to the polls on election day. Is there anything I can do",
    "text":"If the deadline for requesting an absentee ballot by mail has passed and you cannot appear at the polls on election day because of <strong>an accident or sudden illness</strong>, then you may be able to vote by Emergency Absentee Ballot. You'll need to write a letter authorizing a representative to pick up an Absentee Ballot Application and an Absentee Ballot for you. Your representative will need to take this letter to your <a href='http://www.elections.ny.gov/CountyBoards.html'>County Board of Elections</a>. Your County Board of Elections will give the documents to your representative. The application and voted absentee ballot must be returned to your County Board of Elections by 9:00 P.M. on election day. Please contact your<a href='http://www.elections.ny.gov/CountyBoards.html'>County Board of Elections</a> for more information.an accident or sudden illness",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-new-york",
    "name":"Can I vote by absentee ballot on a permanent basis in New York",
    "text":"Under certain circumstances, yes. If you are permanently ill or disabled, you can use the <a href='/files/voter_forms/NewYork_absentee_english.pdf'>New York Absentee Ballot Application</a> to apply for permanent absentee status. Once approved, New York State will automatically mail you an absentee ballot for each eligible election.",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-new-york",
    "name":"Can I vote in person before the election in New York",
    "text":"Yes. Check out our <a href='http://www.longdistancevoter.org/early_voting_rules#new_york'>Early Voting</a> page for details.",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-am-a-first-time-tennesee-voter-can-i-vote-by-absentee-ballot",
    "name":"I am a first time Tennesee voter. Can I vote by absentee ballot",
    "text":"If you registered to vote in person, you may vote by absentee ballot. If you registered to vote by mail, you cannot vote by absentee ballot. You must vote in person the first time you vote.",
    "categories":["56e84152c697911471461f7f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-tennessee",
    "name":"Do I need to provide ID when I register to vote in Tennessee",
    "text":"If you are registering for the first time in Tennessee, you must include a copy of your ID with your voter registration form, or you must show ID the first time you vote at the polls. Acceptable forms of ID include the following: a current voter registration card; a current Tennessee Driver's License; or a photo ID which includes your NAME and SIGNATURE.If you have none of the above items, must provide a combination of one item from List A <strong>AND</strong> one option from List B below:AND<strong>List A:</strong> A current &amp; valid photo I.D. of any kind, either government- issued or private, not containing a voter۪s signature; OR a current utility bill; OR a bank statement; a government check; OR a paycheck; OR any other government document(s) that show the your NAME and ADDRESS; <strong>PLUS:</strong>List A:PLUS:List B: either A)Show ANY document with your NAME and SIGNATURE (Examples: Social security card, credit card with a signature, any other document which has the voter۪s name and signature.); or B)SIGN an official AFFIDAVIT OF IDENTITY form provided by the polling place officials (does not require a notary).List B:",
    "categories":["56e84152c697911471461f7f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-tennessee",
    "name":"Do I need to provide ID when I vote by absentee ballot in Tennessee",
    "text":"You do not need to provide ID if you've already voted in Tennessee at least once, or if you registered to vote in person.",
    "categories":["56e84152c697911471461f7f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"when-is-the-earliest-I can-apply-for-an-absentee-ballot-in-tennessee",
    "name":"When is the earliest I can apply for an absentee ballot in Tennessee",
    "text":"In Tennessee, you may request an application for by-mail voting no earlier than 90 days before the election.",
    "categories":["56e84152c697911471461f7f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-hand-deliver-my-voted-by-mail-absentee-ballot-for-tennessee",
    "name":"Can I hand-deliver my voted by-mail absentee ballot for Tennessee?",
    "text":"No. Tennessee's by-mail ballot must be received by the county election commission office through the postal mail.",
    "categories":["56e84152c697911471461f7f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i've-already-received-by-absentee-ballot-can-i-change-my-mind-and-vote-in-person-in-tennessee",
    "name":"I've already received by absentee ballot. Can I change my mind and vote in person in Tennessee",
    "text":"Once the Tennessee election commission issues your absentee ballot, you cannot change your mind and vote in person. You can only vote by mail.",
    "categories":["56e84152c697911471461f7f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-tennessee",
    "name":"Can I vote by absentee ballot on a permanent basis in Tennessee",
    "text":"Registered Tennessee voters who are unable to vote in person due to medical disability may request to be permanent absentee voters. If you wish to be a permanent absentee voter, you must have your licensed physician complete and file a <a href='/files/voter_forms/Tennessee_physicians_statement.pdf' target='_blank'>Physician's Statement</a> with the Election Commission. By completing and signing this statement, your physician swears under penalty of perjury that you are medically unable to vote in person.Once you become a permanent absentee voter, you will no longer need to request an absente ballot for every election. Instead, the Election Commission will automatically you an absentee ballot application.If you sign and return the application indicating that you would like to vote, the Election Commission will mail you a ballot prior to Election Day. If you indicate that you do not wish to vote, or if you do not return the application, the Election Commission will <span style='text-decoration: underline;'>not</span> mail you a ballot for that election. You will remain on permanent absentee status, and the Election Commission will mail you a new application to vote before the next election.not",
    "categories":["56e84152c697911471461f7f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-tennessee",
    "name":"Can I vote in person before the election in Tennessee",
    "text":"Yes. Check out our <a href='/early_voting_rules#tennessee'>Early Voting</a> page for details.",
    "categories":["56e84152c697911471461f7f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"how-do-i-meet-the-proof-of-citizenship-requirements-when-registering-to-vote",
    "name":"How do I meet the proof of citizenship requirements when registering to vote",
    "text":"Your voter registration form will be rejected if it does not include proof of citizenship.If you have an Arizona state issued ID (driver license or non-operating identification card issued after October 1, 1996) this will serve as proof of citizenship and no additional documents are needed. If not, you must provide one of the following: <li class='std_ListBullet'>A legible photocopy of a birth certificate that verifies citizenship and supporting legal documentation (i.e. marriage certificate) if the name on the birth certificate is not the same as your current legal name</li><li class='std_ListBullet'>A legible photocopy of the pertinent pages of your passport</li><li class='std_ListBullet'>U.S. naturalization documents, presented to your County Recorder</li><li class='std_ListBullet'>Your Alien Registration Number</li><li class='std_ListBullet'>Your Indian Census Number<strong>, </strong>Bureau of Indian Affairs Card Number, Tribal Treaty Card Number, or Tribal Enrollment Number</li><li class='std_ListBullet'>A legible photocopy of your Tribal Certificate of Indian Blood or Tribal or Bureau of Indian Affairs Affidavit of Birth.</li>A legible photocopy of a birth certificate that verifies citizenship and supporting legal documentation (i.e. marriage certificate) if the name on the birth certificate is not the same as your current legal nameA legible photocopy of the pertinent pages of your passportU.S. naturalization documents, presented to your County RecorderYour Alien Registration NumberYour Indian Census Number<strong>, </strong>Bureau of Indian Affairs Card Number, Tribal Treaty Card Number, or Tribal Enrollment Number, A legible photocopy of your Tribal Certificate of Indian Blood or Tribal or Bureau of Indian Affairs Affidavit of Birth.If you are registered in Arizona and use the registration form because you move within a county, change your name, or change your political party affiliation, you do not need to provide photocopies of proof of citizenship. <strong>If you move to a different Arizona county, you will again need to provide proof of citizenship.</strong>If you move to a different Arizona county, you will again need to provide proof of citizenship.",
    "categories":["56e8413d90336026d8718551"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-an-absentee-ballot",
    "name":"Do I need to provide ID when I apply for an absentee ballot",
    "text":"No, but Arizona will not issue an absentee ballot if the state cannot verify your identity or citizenship status when you make your request for a ballot. It's best to verify your voter registration before attempting to apply for an absentee ballot. ",
    "categories":["56e8413d90336026d8718551"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-missed-the-absentee-ballot-application-deadline-is-there-anything-i-can-do",
    "name":"I missed the absentee ballot application deadline. Is there anything I can do",
    "text":"If you've missed the absentee/early voting deadline, and an unforeseen circumstance occurs which will prevent you from voting at the polling place, emergency early voting is permitted in Arizona. Contact your <a href='http://www.azsos.gov/election/county.htm'>County Recorder's Office</a> to learn more about emergency early voting.",
    "categories":["56e8413d90336026d8718551"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis",
    "name":"Can I vote by absentee ballot on a permanent basis",
    "text":"If your mailing address is the same as home address - or if your mailing address is in the same county as your home address - you can add your name to the Arizona 'Permanent Early Voting List.' Once you are on this list, an early ballot will automatically be mailed to you approximately 26 days prior to each election for which you are qualified to vote. You can use the <a href='/files/voter_forms/arizona-absentee.pdf'>Arizona Early Voting Ballot Application</a> to add your name to the permanent early voting list.",
    "categories":["56e8413d90336026d8718551"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election",
    "name":"Can I vote in person before the election",
    "text":"Yes. Check out our <a href='/early_voting_rules#arizona'>Early Voting</a> page for details.",
    "categories":["56e8413d90336026d8718551"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-illinois",
    "name":"Do I need to provide ID when I register to vote in Illinois",
    "text":"Yes. If you register to vote in person you must show two forms if identification, including one which shows your current Illinois address. If you register to vote by mail, you can meet the ID requirements by putting your Illinois driver's license number or Illinois state ID card number on the form. If you don't have either of those, include a copy of a current and valid photo identification, or a copy of a current utility bill, bank statement, paycheck, government check, or other government document that shows your name and address.You can also meet the ID requirements by showing a photo ID issued by an Illinois college or university AND a copy of your Illinois lease or any postmarked mail delivered to the your at your current residence address.",
    "categories":["56e8414390336026d8718557"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-illinois",
    "name":"Do I need to provide ID when I vote by absentee ballot in Illinois",
    "text":"No. You can only vote by absentee ballot in Illinois if you've already met the voter ID requirements.",
    "categories":["56e8414390336026d8718557"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"when-should-i-apply-for-my-absentee-ballot-in-illinois",
    "name":"When should I apply for my absentee ballot in Illinois",
    "text":"Illinois has strict timelines in which to apply for your absentee ballot:<li>Absentee By-Mail - Not more than 40 days nor less than 5 days prior to the election</li><li>Absentee In-Person - Not more than 40 days nor less than 1 day prior to the election.</li>Absentee By-Mail - Not more than 40 days nor less than 5 days prior to the electionAbsentee In-Person - Not more than 40 days nor less than 1 day prior to the election.",
    "categories":["56e8414390336026d8718557"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-illinois",
    "name":"Can I vote by absentee ballot on a permanent basis in Illinois",
    "text":"In most cases, no. Disabled voters, nursing home residents, and care facility residents can use the <a href='/files/voter_forms/Illinois_absentee_incapacitated.pdf' target='_blank'>Application for Absentee Voter's 5 Year Identification Card form</a> to automatically receive absentee ballot applications (not absentee ballots!) for every election for the next 5 years.",
    "categories":["56e8414390336026d8718557"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"ineed-an-emergency-absentee-ballot-in-illinois-help!",
    "name":"Ineed an emergency absentee ballot in Illinois. Help!",
    "text":"If you are admitted to a health care facility (hospital, nursing home, or rehabilitation center) less than five days before the election, you can apply for an emergency absentee ballot. The form is called the Application for Ballot for Qualified Voter Admitted to Hospital, Nursing Home or Rehabilitation Center.۝ You must contactyour <a href='http://www.elections.state.il.us/ElectionAuthorities/ElecAuthorityList.aspx'>Local Election Authority</a> to request this form.You must complete the application and your physician must complete and sign the Certificate of Attending Physician۝ section of the application. After the form is completed and signed by you and your physician, a registered voter from your precinct or your relative can then hand deliver the application toyour <a href='http://www.elections.state.il.us/ElectionAuthorities/ElecAuthorityList.aspx'>Local Election Authority</a>. The county election authority will provide the absentee ballot to the person who delivered your application. Once you receive the ballot, vote the ballot in secret and complete the certification on the absentee ballot return envelope. Give your voted absentee ballot back to the person who delivered your application. This person must return your voted ballottoyour <a href='http://www.elections.state.il.us/ElectionAuthorities/ElecAuthorityList.aspx'>Local Election Authority</a>.",
    "categories":["56e8414390336026d8718557"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-election-day-in-illinois",
    "name":"Can I vote in person before election day in Illinois",
    "text":"YES! Illinois offers two forms of early voting: 1. Absentee in-person, which takes place at County Clerks' offices and 2. Traditional early voting at various locations in each county. Learn more on our <a href='/early_voting_rules#illinois'>Early Voting</a> page.",
    "categories":["56e8414390336026d8718557"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i'm-a-registered-minnesota-voter-do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot",
    "name":"I'm a registered Minnesota voter. Do I need to provide IDwhen I apply for my absentee ballot",
    "text":"If you have already voted in Minnesota and have not moved or changed your name, you do not need to provide ID. If you have moved (even from one apartment to another) or changed your name, you will need to re-register to vote and will need to provide proof of residence. You can find the list of acceptable forms of proof of residence on the <a class='ext' href='http://www.sos.state.mn.us/home/index.asppage=204' target='_blank'>Minnesota Secretary of State website</a>.",
    "categories":["56e8414890336026d871855e"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-minnesota",
    "name":"Can I vote by absentee ballot on a permanent basis in Minnesota",
    "text":"Under certain circumstances, yes. If you are permanently disabled; unable to vote on election day due to religious holiday; an election judge in another precinct; or away from your home on an ongoing basis, you may apply for permanent absentee voter status. Download and complete the <a href='/files/voter_forms/Minnesota_absentee_permanent.pdf'>Minnesota Application to Automatically Receive Absentee Ballot Applications</a>. Once you are approved, you'll receive an absentee ballot application by mail before every election. You'll still need to return the application, however, to receive your absentee ballot.",
    "categories":["56e8414890336026d871855e"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-minnesota",
    "name":"Can I vote in person before the election in Minnesota",
    "text":"Yes. Check out our <a href='/early_voting_rules#minnesota'>Early Voting</a> page for details.",
    "categories":["56e8414890336026d871855e"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-missed-the-voter-registration-deadline-for-north-carolina-what-can-ido",
    "name":"I missed the voter registration deadline for North Carolina. What can Ido",
    "text":"A North Carolina resident who is qualified to vote but who misses the 25-day deadline for voter registration may register and vote in person before election day at an Early Voting Site. If you do this, you must vote at the Early Voting Site during the early voting period; you cannot vote by mail or at the polls on election day. See our <a href='/early_voting_rules#north_carolina'>Early Voting</a> page for more information.",
    "categories":["56e8414e90336026d8718563"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-north-carolina",
    "name":"Do I need to provide IDwhen I apply for my absentee ballot in North Carolina",
    "text":"You do not need to provide ID if you've already voted in North Carolina at least once. If you are voting for the first time in North Carolina and you did not meet the ID requirements when you registered to vote, then you must include a COPY of a current and valid photo ID that shows your name OR a current utility bill, bank statement, government check, paycheck or other government document that shows your name and North Carolina address.first time",
    "categories":["56e8414e90336026d8718563"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"long-distance-voter-has-created-custom-absentee-ballot-application-forms-for-other-states-why-not-north-carolina",
    "name":"Long Distance Voter has created custom absentee ballot application forms for other states, why not North Carolina",
    "text":"We made a North Carolina absentee ballot application, but we were informed by the State Board of Elections that it is against state law for a third party (such as Long Distance Voter) to create and distribute absentee ballot applications. The state isn't being malicious, but they are concerned about outside influence on elections.We think the best solution at this point is for the State Board of Elections to create their own formal absentee ballot application and to make it available on their website. If you agree with us - and we bet you do - <strong>call the State Board of Elections and ask them to create a formal statewide absentee ballot application.</strong> Here are their phone numbers:(919) 733-7173or (866) 522-4723.call the State Board of Elections and ask them to create a formal statewide absentee ballot application.",
    "categories":["56e8414e90336026d8718563"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-north-carolina",
    "name":"Can I vote in person before the election in North Carolina",
    "text":"Yes. Check out our <a href='/early_voting_rules#north_carolina'>Early Voting</a> page for details.",
    "categories":["56e8414e90336026d8718563"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-texas",
    "name":"Do I need to provide ID when I vote by absentee ballot in Texas",
    "text":"You do not need to provide ID if you have already voted at least once in Texas. If you are <strong>a first time voter and you did not put your drivers license number or Social Security number on your voter registration form</strong> then you must include a copy of one of the following forms of <strong>Photo ID</strong> with your absentee ballot application:a first time voter and you did not put your drivers license number or Social Security number on your voter registration formPhoto ID<li>Texas Driver License issued by Texas DPS</li><li>Texas Election Identification Certificate (EIC) issued by DPS</li><li>Texas Personal Identification Card issued by DPS</li><li>Texas Concealed Handgun License issued by DPS</li><li>U.S. Military ID card containing your photograph</li><li>U.S. Citizenship Certificate containing your photograph</li><li>U.S. Passport</li>Texas Driver License issued by Texas DPSTexas Election Identification Certificate (EIC) issued by DPSTexas Personal Identification Card issued by DPSTexas Concealed Handgun License issued by DPSU.S. Military ID card containing your photographU.S. Citizenship Certificate containing your photographU.S. Passport(All documents except the U.S. citizenship certificate must be current or no more than 60 days expired.)NOTE: If you are <strong>disabled</strong>, <strong>in the military</strong>, or <strong>living overseas</strong>, you are NOT required to include a copy of your identification. However, you must complete and return a special form to that effect, which your Texas County Elections Office should mail to you.disabledin the militaryliving overseas",
    "categories":["56e8415290336026d8718569"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-missed-the-absentee-ballot-application-deadline-in-texas-is-there-anything-I can-do",
    "name":"I missed the absentee ballot application deadline in Texas. Is there anything I can do",
    "text":"In most cases, no. If you experience a death in your family on or after the third day before an election - and you can no longer vote in person - you can request anEmergency Absentee Ballot. Complete the <a href='/files/voter_forms/Texas_absentee_emergency.pdf'>Texas Emergency Absentee Ballot Application</a> and <strong>hand-deliver</strong> it to your<a href='http://www.sos.state.tx.us/elections/voter/county.shtml' style='color: rgb(2, 122, 198); text-decoration: none;'>Early Voting Clerk</a>on or after the 3rd day before election day and before 5pm the day before the election.hand-deliver",
    "categories":["56e8415290336026d8718569"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-texas",
    "name":"Can I vote in person before the election in Texas",
    "text":"Yes. Check out our <a href='/early_voting_rules#texas'>Early Voting</a> page for details.",
    "categories":["56e8415290336026d8718569"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-arkansas",
    "name":"Do I need to provide ID when I register to vote in Arkansas",
    "text":"You must provide either your driver's license number or the last four digits of your Social Security number on your Arkansas Voter Registration Application, or check the box in #7 on the application to indicate that you do not possess either a driver's license or Social Security number. If you check the box indicating that you do not possess either a driver's license or Social Security number, you may be required to vote a Provisional Ballot when you vote for the first time unless you submit a photocopy of one of the following with your mail-in application or at the time of voting: a current and valid photo identification; or a copy of a current utility bill, bank statement, government check or paycheck that shows your name and address; or another government document that shows your name and address.",
    "categories":["56e8413e90336026d8718552"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-arkansas",
    "name":"Do I need to provide ID when I vote by absentee ballot in Arkansas",
    "text":"You do not need to provide ID if you've already voted at least once. If you are first-time Arkansas voter who registered to vote by mail - and you did NOT include a copy of your ID with your voter registration form - you'll need to include a copy of your ID with your absentee ballot application. Acceptable forms of ID include a COPY of a current and valid photo identification and address OR a COPY of a current utility bill, bank statement, government check, paycheck or other government document that shows your name and address.",
    "categories":["56e8413e90336026d8718552"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-arkansas",
    "name":"Can I vote in person before the election in Arkansas",
    "text":"Yes. Check out our <a href='/early_voting_rules#arkansas'>Early Voting</a> page for details.",
    "categories":["56e8413e90336026d8718552"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-indiana",
    "name":"Do I need to provide ID when I register to vote in Indiana",
    "text":"If you are registering to vote in Indiana for the first time, and you register to vote by mail, you must provide proof of residency before voting for the first time (either in person or by absentee ballot). If you'd like, you can submit proof of residency with your voter registration form. Accceptable proof of residency includes: a COPY of your Indiana Driver۪s License or other current and valid photo ID that shows your name and Indiana address; a COPY of a current utility bill or bank statement that shows your name and Indiana address; a COPY of a government check or other government document that shows your name and Indiana address; OR a COPY of a paycheck that shows your name and address.",
    "categories":["56e8414390336026d8718558"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-indiana",
    "name":"Do I need to provide ID when I vote by absentee ballot in Indiana",
    "text":"You do not need to provide ID if you've already voted in Indiana at least once. If you are a first time Indiana voter and you did not provide proof of Indiana residency with your voter registration application, you must include one of the following documents with your absentee ballot application: a copy of your Indiana Driver۪s License or other current and valid photo identification and Indiana address;a copy of a current utility bill or bank statement that shows your name and Indiana address; a copy of a government check or other government document that shows your name and Indiana address; or a copy of a paycheck that shows your name and address.first time ",
    "categories":["56e8414390336026d8718558"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-indiana",
    "name":"Can I vote in person before the election in Indiana",
    "text":"Yes. Check out our <a href='/early_voting_rules#indiana'>Early Voting</a> page for details.",
    "categories":["56e8414390336026d8718558"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-mississippi",
    "name":"Do I need to provide ID when I apply for my absentee ballot in Mississippi",
    "text":"You do not need to include ID if you've already voted in your county at least once. If you're a first-time voter in your county, and you did not include your Mississippi driver's license or a copy of your ID with your voter registration form, you must include a copy with your absentee ballot application. Acceptable ID includes: a copy of a current and valid photo ID that shows OR a copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and Mississippi address.",
    "categories":["56e84148c697911471461f77"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-mississippi",
    "name":"Can I vote in person before the election in Mississippi",
    "text":"No. In-person early voting is not allowed.No. ",
    "categories":["56e84148c697911471461f77"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"if-my-right-to-vote-in-north-dakota-is-challenged-what-kind-of-documentation-do-i-need-to-provide",
    "name":"If my right to vote in North Dakota is challenged, what kind of documentation do Ineed to provide",
    "text":"If your right to vote is challenged in North Dakota, you can provide documentation that shows your name and North Dakota street address (P.O. Boxes do not establish residency).Acceptable forms of ID include:<li>Valid North Dakota Drivers License</li><li>Valid State Identification Card</li><li>Valid Federally Issued Identification Card, such as a Passport or an Agency Identification Card</li><li>Valid Tribal Government Issued Identification Card</li><li>Valid Student Identification Card</li><li>Valid United States Military Identification Card</li><li>Utility bill dated 30 days prior to election day with name and residential address</li><li>Change of address verification letter from the US Postal Service</li>Valid North Dakota Drivers LicenseValid State Identification CardValid Federally Issued Identification Card, such as a Passport or an Agency Identification CardValid Tribal Government Issued Identification CardValid Student Identification CardValid United States Military Identification CardUtility bill dated 30 days prior to election day with name and residential addressChange of address verification letter from the US Postal Service",
    "categories":["56e8414e90336026d8718563"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-north-dakota",
    "name":"Can I vote in person before the election in North Dakota",
    "text":"Yes. Check out our <a href='http://www.longdistancevoter.org/early_voting_rules#north_dakota '>Early Voting</a> page for details.",
    "categories":["56e8414e90336026d8718563"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-an-absentee-ballot-in-utah",
    "name":"Do I need to provide ID when I apply for an absentee ballot in Utah",
    "text":"You do not need to provide ID if you've voted in person at Utah once. If you are a first-time voter and you did not include a copy of your photo ID or your proof of residency with your voter registration form, include it with your Absentee Ballot Application. Include a copy of a one valid form of photo identification that shows your name and Utah address (ex: Utah license, Utah state ID card, US passport or Military ID), or two different documents that show your name and Utah address (current utility bill, bank statement, paycheck, or government document).first-timeonetwo",
    "categories":["56e8415390336026d871856a"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-utah",
    "name":"Can I vote by absentee ballot on a permanent basis in Utah",
    "text":"YES! You can use the <a href='/files/voter_forms/Utah_absentee_english.pdf'>Utah Absentee Ballot Application</a> to apply for permanent absentee voter status -- simply check off the box. Once you're approved, Utah will automatically send you an absentee ballot for each eligible election. This is a great way to make sure you never miss another election!",
    "categories":["56e8415390336026d871856a"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-need-an-emergency-absentee-ballot-in-utah-help!",
    "name":"I need an emergency absentee ballot in Utah. Help!",
    "text":"If you are hospitalized or otherwise confined to a medical or long-term care institution after the deadline for filing an application for an absentee ballot, you may obtain an Emergency Absentee Ballot by contacting your <a href='http://www.elections.utah.gov/election-resources/county-clerks'>County Clerk</a>.You or your representative must return your voted absentee ballot to the election officer (either your County Clerk or your City Clerk or Recorder, depending on the year) before the polls close on election day.",
    "categories":["56e8415390336026d871856a"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-utah",
    "name":"Can I vote in person before the election in Utah",
    "text":"Yes. Check out our <a href='/early_voting_rules#utah'>Early Voting</a> page for details.",
    "categories":["56e8415390336026d871856a"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-california",
    "name":"Do I need to provide ID when I register to vote in California",
    "text":"You must include your California driver's license number, or your CA identification card number, on your voter registration form. If you don't have either of these numbers, you should include a copy of your ID with your voter registration form. Acceptable forms of ID include a current and valid photo identification OR a current utility bill, bank statement, government check, or other government document that shows your name and address. Note: military voters, overseas voters, and elderly or handicapped voters are exempt from these requirements.Note:",
    "categories":["56e8413ec697911471461f6f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-california",
    "name":"Do I need to provide ID when I vote by absentee ballot in California",
    "text":"You do not need to provide ID if you've already voted in California at least once. If you are a first-time California voter and you registered to vote by mail and you did not include identifying information with your voter registration form (such as your driver's license number, your state ID number, or a copy of your ID), then you then you must submit a copy of one of the following documents with your absentee ballot application: a current and valid photo identification OR a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and California address.first-timeby mailcopy",
    "categories":["56e8413ec697911471461f6f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-california",
    "name":"Can I vote by absentee ballot on a permanent basis in California",
    "text":"California is one of the few states in the nation that offers permanent absentee status to all voters. You can use the <a href='/files/voter_forms/California_absentee_english.pdf'>California absentee ballot application</a> to sign up for the permanent by-mail voter list. (There's a checkbox on the right side of the form.) California will then mail you an absentee ballot for every eligible election. This is a great way to make sure you never miss another election.You will retain permanent absentee voter status as long as you vote in all statewide primary and general elections. If you fail to cast a ballot in two consecutive statewide general elections, you will be removed from the permanent absentee voter list and will need to reapply in order to restore status.",
    "categories":["56e8413ec697911471461f6f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-need-a-california-emergency-absentee-ballot-help!",
    "name":"I need a California emergency absentee ballot. Help!",
    "text":"During the 6 days before the election - and on election day - you may go to the office of your County Elections Official, apply for and vote an <em>emergency vote-by-mail ballot</em> at that office. Emergency Vote-By-Mail ballots are issued in person, not by mail (the name is slightly misleading). Please contact your<a href='http://www.sos.ca.gov/elections/elections_d.htm'>County Elections Official</a> to learn more.emergency vote-by-mail ballot",
    "categories":["56e8413ec697911471461f6f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-missed-the-absentee-ballot-application-deadline-for-california-is-there-anything-i-can-do",
    "name":"I missed the absentee ballot application deadline for California. Is there anything I can do",
    "text":"If you're in state, there are two things you can do:<li>You can vote an emergency vote-by-mail ballot at your <a href='http://www.sos.ca.gov/elections/elections_d.htm'>County Elections Official's</a> office (see above).</li><li>California offers <strong>no excuse in-person voting</strong> at various locations throughout the state. Visit our <a href='/early_voting_rules/#california'>Early Voting</a> page to learn more.</li>You can vote an emergency vote-by-mail ballot at your <a href='http://www.sos.ca.gov/elections/elections_d.htm'>County Elections Official's</a> office (see above).California offers <strong>no excuse in-person voting</strong> at various locations throughout the state. Visit our <a href='/early_voting_rules/#california'>Early Voting</a> page to learn more.no excuse in-person voting",
    "categories":["56e8413ec697911471461f6f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i've-already-received-my-california-absentee-ballot-can-i-still-vote-in-person",
    "name":"I've already received my California absentee ballot. Can I still vote in person",
    "text":"YES! You must bring your non-voted by-mail ballot and give it to the polling place worker before voting a regular ballot.",
    "categories":["56e8413ec697911471461f6f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-iregister-to-vote-in-iowa",
    "name":"Do I need to provide ID when Iregister to vote in Iowa",
    "text":"If you're <strong>registering for the </strong>first time in Iowa and you do not have an Iowa driver's license number, or an Iowa non-driver ID card number, then you must include a copy of your ID with your voter registration form. If you forget, you'll need to provide ID the first time you vote in person or by absentee ballot. Acceptable forms of ID include: a copy of a current photo ID with your name and Iowa address OR a copy of a utility bill, bank statement, government check, paycheck or government document which shows your name and Iowa address. If you register to vote in person on election day, bring a copy of your ID with you to the polls!registering for the first time",
    "categories":["56e8414490336026d8718559"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-iowa",
    "name":"Do I need to provide ID when I vote by absentee ballot in Iowa",
    "text":"You do not need to provide ID if you've already voted in Iowa at least once. If you are a first-time voter who registered to vote by mail, and you did not meet the ID requirements when you registered to vote, then you should include a copy of your ID with your absentee ballot application. Acceptable forms of ID include: a COPY of a current and valid photo ID OR a COPY of a utility bill, bank statement, government check, paycheck or government document which shows your name and Iowa address.",
    "categories":["56e8414490336026d8718559"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-iowa",
    "name":"Can I vote in person before the election in Iowa",
    "text":"Yes. Check out our <a href='/early_voting_rules#iowa'>Early Voting</a> page for details.",
    "categories":["56e8414490336026d8718559"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-missouri",
    "name":"Do I need to provide ID when I apply for my absentee ballot in Missouri",
    "text":"You do not need to provide ID if you've already voted in Missouri at least once. If you are a first time voter and you did not submit a copy of your ID with your voter registration form, then you must submit ID with your absentee ballot application. Acceptable forms of ID include: Identification issued by the state of Missouri, an agency of the state, or a local election authority of the state;Identification issued by the United States government or agency thereof;Driver۪s license or state identification card issued by another state; orother identification approved by federal law; Identification issued by an institution of higher education, including a university, college, vocational and technical school, located within the state of Missouri; or a copy of a current utility bill, bank statement, government check, paycheck or other government document that contains the name and address of the voter.first time",
    "categories":["56e84149c697911471461f78"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-missouri",
    "name":"Can I vote in person before the election in Missouri",
    "text":"Yes. See our <a href='/early_voting_rules#missouri'>ealrly voting page</a> for more details.",
    "categories":["56e84149c697911471461f78"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-ohio",
    "name":"Do I need to provide ID when I apply for my absentee ballot in Ohio",
    "text":"You need to include your Ohio driver's license number or the last four digits of your Social Security number on your absentee ballot application. If you don't have one of these numbers, then you must a copy of your identification. Acceptable ID includes: a current and valid photo ID that shows your name; a military identification that shows your name; or a current utility bill, bank statement, government check, paycheck, or other government document (other than a voter registration notification mailed by a board of elections) that shows your name and address.",
    "categories":["56e8414e90336026d8718564"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-ohio",
    "name":"Can I vote in person before the election in Ohio",
    "text":"Yes. Check out our <a href='http://www.longdistancevoter.org/early_voting_rules#ohio'>Early Voting</a> page for details.",
    "categories":["56e8414e90336026d8718564"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-vermont",
    "name":"Do I need to provide IDwhen I apply for my absentee ballot in Vermont",
    "text":"You do not need to provide ID if you have already voted in Vermont at least once. If you are a first time Vermont voter, and you did not include a copy of your ID with your voter registration form, then you must include a copy with your absentee ballot application.Acceptable identification includes a: a current and valid photo that shows your name ID or a current bank statement, utility bill, or government document that contains your name and Vermont address.",
    "categories":["56e84153c697911471461f80"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-iregister-to-vote-and-request-my-absentee-ballot-at-the-same-time-in-vermont",
    "name":"Can Iregister to vote and request my absentee ballot at the same time in Vermont",
    "text":"Yes, you can put your voter registration form and your early voter ballot application in the same envelope and return both to your town or city clerk. If you do this, both forms must be received by the voter registration deadline (5pm on the Wednesday before the election).",
    "categories":["56e84153c697911471461f80"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-vermont",
    "name":"Can I vote in person before the election in Vermont",
    "text":"Yes. Check out our <a href='/early_voting_rules#vermont'>Early Voting</a> page for details.",
    "categories":["56e84153c697911471461f80"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-colorado",
    "name":"Do I need to provide ID when I register to vote in Colorado",
    "text":"No, but you do need to provide your Colorado Driver's License Number or your Department of Revenue Identification Number. If you don't have one of these numbers, you must provide the last four digits of your Social Security Number. If you don't have any of these numbers, you must indicate this on your voter registration form. If you don't follow these guidelines, you're voter registration form will not be processed.Please note: Colorado law requires ID from all voters at the polls, and from all first-time voters who cast absentee ballots (i.e. by-mail ballots). If you plan on voting by absentee ballot, you can include a copy of your ID with your voter registration form OR with your absentee ballot application OR with your voted absentee ballot.",
    "categories":["56e8413f90336026d8718553"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-colorado",
    "name":"Do I need to provide ID when I vote by absentee ballot in Colorado",
    "text":"Not unless you're a first-time Colorado voter. If you're a first-time voter, and you did not include a copy of your ID with your voter registration form, you must include a copy with your absentee ballot application or with your voted absentee ballot. The following forms of identification are acceptable, as long as they show your name and a Colorado address:<li>A valid Colorado driver۪s license</li><li>A valid identification card issued by the Colorado Department of Revenue</li><li>A valid U.S. passport</li><li>A valid employee identification card with a photograph of the eligible elector issued by any branch, department, agency, or entity of the United States government or of this state, or by any county, municipality, board, authority, or other political subdivision of this state</li><li>A valid pilot۪s license issued by the federal aviation administration or other authorized agency of the United States</li><li>A valid U.S. military identification card with a photograph</li><li>A copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows the name and address of the elector (A cable bill, a telephone bill, documentation from a public institution of higher education in Colorado containing at least the name, date of birth, and residence address of the student elector, or a paycheck from a government institution are sufficient forms of ID)</li><li>A valid Medicare or Medicaid card</li><li>A certified copy of a U.S. birth certificate</li><li>Certified documentation of naturalization</li><li>A valid student identification card with a photograph issued by a institution of higher education in Colorado</li>A valid Colorado driver۪s licenseA valid identification card issued by the Colorado Department of RevenueA valid U.S. passportA valid employee identification card with a photograph of the eligible elector issued by any branch, department, agency, or entity of the United States government or of this state, or by any county, municipality, board, authority, or other political subdivision of this stateA valid pilot۪s license issued by the federal aviation administration or other authorized agency of the United StatesA valid U.S. military identification card with a photographA copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows the name and address of the elector (A cable bill, a telephone bill, documentation from a public institution of higher education in Colorado containing at least the name, date of birth, and residence address of the student elector, or a paycheck from a government institution are sufficient forms of ID)A valid Medicare or Medicaid cardA certified copy of a U.S. birth certificateCertified documentation of naturalizationA valid student identification card with a photograph issued by a institution of higher education in Colorado",
    "categories":["56e8413f90336026d8718553"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-colorado",
    "name":"Can I vote by absentee ballot on a permanent basis in Colorado",
    "text":"YES! You can update your mailing address online at <a href='http://www.govotecolorado.com'>GoVoteColorado.com</a>, anytime you change your address. You can also use that service to change your address back, if you wish to have mail delivered again to the address where you are registered to vote.",
    "categories":["56e8413f90336026d8718553"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-colorado",
    "name":"Can I vote in person before the election in Colorado",
    "text":"Yes. Check out our <a href='/early_voting_rules#colorado'>Early Voting</a> page for details.",
    "categories":["56e8413f90336026d8718553"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-lost-my-colorado-absentee-ballot-can-i-still-vote-in-person",
    "name":"I lost my Colorado absentee ballot. Can I still vote in person",
    "text":"YES! If you lose your Absentee Ballot or otherwise destroy it, you may vote during the Early Voting period or on election day. When you vote, you will be provided a provisional ballot, and you must affirm that you requested an Absentee Ballot and did not and will not vote it.",
    "categories":["56e8413f90336026d8718553"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-kansas",
    "name":"Do I need to provide ID when I register to vote in Kansas",
    "text":"When you register, you must put your current Kansas driver's license number or non-driver's identification number on your voter registration form. If you do not have either number, enter the last four digits of your social security number. If you don't have any of these numbers, you must check the 'none' box on the form. <strong>However, you will need to provide photo ID when you vote, whether you vote in person or by mail.</strong>However, you will need to provide photo ID when you vote, whether you vote in person or by mail.",
    "categories":["56e8414490336026d871855a"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-voting-by-absentee-ballot-in-kansas",
    "name":"Do I need to provide ID when voting by absentee ballot in Kansas",
    "text":"<strong>Yes. </strong>Every voter must now provide a valid form of identification, with the exception of: persons with a permanent physical disability that makes it impossible for them to travel to obtain voting identification and who have permanent advance voting status; members of the merchant marine and uniformed service memberswho are on active duty and absent from the county on election day, as well as their spouses and dependents; and any voter whose religious beliefs prohibit photographic identification.Yes. When you apply for your absentee ballot, you must provide your current and valid Kansas driver's license number, nondriver's identification card number, or a photocopy of any ID listed below.The following forms of ID are valid if they contain the name and photograph of the voter and have not expired:* driver's license issued by Kansas or another state; state identification card; government-issued concealed carry handgun or weapon license; U.S. passport; employee badge or identification document issued by a government office or agency; military ID; student ID issued by an accredited postsecondary institution in Kansas; government-issued public assistance ID card.<span style='font-size:11px;'>*Expired documents are valid if the bearer is aged 65 or older.</span>*Expired documents are valid if the bearer is aged 65 or older.",
    "categories":["56e8414490336026d871855a"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-kansas",
    "name":"Can I vote in person before the election in Kansas",
    "text":"Yes. Check out our <a href='/early_voting_rules#kansas'>Early Voting</a> page for details.",
    "categories":["56e8414490336026d871855a"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-montana",
    "name":"Do I need to provide IDwhen I register to vote in Montana",
    "text":"You need to include your Montana driver's license number (or your non-drivers ID card number) on your voter registration form. If you don't have either of these numbers, you'll need to provide ID before voting for the first time. You can meet the voter ID requirements by including a copy of your ID with your voter registration form. Acceptable forms of ID include: a copy of a photo ID that shows your name OR a copy of a currentutility bill, bank statement, government check, paycheck, or government document that shows your name and Montana address.",
    "categories":["56e84149c697911471461f79"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-missed-the-montana-voter-registration-deadline-is-there-anything-i-can-do",
    "name":"I missed the Montana voter registration deadline. Is there anything I can do",
    "text":"If you miss that deadline, you can still register and vote in the election by <strong>late registering</strong> at your county election office. You can late-register right up until close of polls on election day.late registeringLate registration is available at any time right up through the close of polls on election day. No absentee ballots are issued between noon and 5pm the day before the election however, so if you haven۪t registered before then, you should wait until election day to register and vote.",
    "categories":["56e84149c697911471461f79"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-montana",
    "name":"Do I need to provide ID when I vote by absentee ballot in Montana",
    "text":"You don't need to provide ID if you've already voted in Montana at least once. If you are a first-time Montana voter, and you did not meet the ID requirements when you registered to vote, you must include a copy of your ID with your absentee ballot application. Acceptable ID includes a photo ID that shows your name, OR a copy of a current utility bill, bank statement, paycheck, government check, or other government document that shows your name and Montana address.",
    "categories":["56e84149c697911471461f79"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-montana",
    "name":"Can I vote by absentee ballot on a permanent basis in Montana",
    "text":"Montana is one of the few states in the nation that offers permanent absentee status to voters. Use the <a href='/files/voter_forms/Montana_absentee.pdf'>Montana Absentee Ballot Application</a> to add yourself to the Permanent Absentee List. You can choose to have ballots sent to you for every subsequent election (including municipal, state and federal) or just for federal elections. You will need to respond to certain confirmation mailings to remain on the list. Permanent absentee status is a great way to make sure you never miss another election.",
    "categories":["56e84149c697911471461f79"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"does-montana-offer-emergency-absentee-ballots",
    "name":"Does Montana offer emergency absentee ballots",
    "text":"You are are subject to illness or hospitalization between 5pm on the Friday before election day and noon on election day, you may apply for an emergency absentee ballot. Your <a href='http://sos.mt.gov/Elections/forms/elections/electionadministrators.pdf'>County Election Administrator</a> will authorize a special absentee election board to bring an emergency absentee ballot to you. Contact your <a href='http://sos.mt.gov/Elections/forms/elections/electionadministrators.pdf'>County Election Administrator</a> for more information.",
    "categories":["56e84149c697911471461f79"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-montana",
    "name":"Can I vote in person before the election in Montana",
    "text":"Yes. Check out our <a href='/early_voting_rules#montana'>Early Voting</a> page for details.",
    "categories":["56e84149c697911471461f79"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-oklahoma",
    "name":"Do I need to provide IDwhen I vote by absentee ballot in Oklahoma",
    "text":"You do not need to provide ID if you've already voted in Oklahoma at least once. If you are voting for the first time in Oklahoma and you did not include a copy of your ID with your voter registration form, you must include a copy with your absentee ballot application. You may provide a copy of a current driver۪s license or other photo identification that shows your name OR a copy of a utility bill, bank statement, government check, paycheck, or government document that shows your name and Oklahoma address.",
    "categories":["56e8414f90336026d8718565"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-need-an-emergency-absentee-ballot-in-oklahoma-help!",
    "name":"I need an emergency absentee ballot in Oklahoma. Help!",
    "text":"If you are incapacitated or hospitalized after 5 p.m. on the Tuesday before election day, you may vote using an emergency absentee ballot. You must submit a written request to your local county election board, and your request must include a statement from your doctor that you are incapacitated and unable to vote in person on election day. (Your county election office can also provide a form for your voter request and your doctor's statement). Find someone to hand-deliver your written request and your doctor's statement to the county election board office. This person is considered your 'agent.' The county board will give your agent your absentee ballot. After your complete your absentee ballot, your agent must return it to the county election board office before 7 p.m. election day.5 p.m. on the Tuesday before election day7 p.m. election day",
    "categories":["56e8414f90336026d8718565"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-oklahoma",
    "name":"Can I vote in person before the election in Oklahoma",
    "text":"Yes, in Oklahoma you can. Check out our <a href='/early_voting_rules#oklahoma'>Early Voting</a> page for details.",
    "categories":["56e8414f90336026d8718565"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"warning-to-first-time-voters-in-virginia",
    "name":"Warning to First-Time Voters in Virginia",
    "text":"If you registered to vote <strong>by mail</strong>, you must vote <strong>in person the first time you vote</strong>. Exceptions to the first-time rule are: full time college students, active duty military and overseas residents, physically handicapped individuals, and people over 65 who have another qualifying reason (age alone is not a justification).by mailin person the first time you voteIf you registered to vote <strong>in person</strong>, you may vote by absentee ballot the first time you vote, but you have to <strong>wait 5 days after registering</strong> before you can request an absentee ballot.in personwait 5 days after registering",
    "categories":["56e8415490336026d871856b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-virginia",
    "name":"Do I need to provide ID when I register to vote in Virginia",
    "text":"If you are registering for the first time by mail, federal law (the Help America Vote Act) requires you to provide identification. Please enclose a copy of one of the following documents that shows your name and Virginia address with your application: (1) current and valid photo ID, (2) current utility bill, (3) bank statement, (4) government check, (5) paycheck, or (6) other government document. You can also present this required identification at the polls or when you apply for your absentee ballot.",
    "categories":["56e8415490336026d871856b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-virginia",
    "name":"Do I need to provide IDwhen I vote by absentee ballot in Virginia",
    "text":"If you registered in person and provided sufficient ID at that time, you won't need to provide IDwhen you vote absentee. If you registered to vote by mail, and you did not fulfill the ID requirements at that time, you should include a copy of your ID with your absentee ballot application. If you don't, you'll be notified by mail that you must provide a copy of your identification in order to receive an absentee ballot.Acceptable forms of ID include: A current and valid photo ID (for example a driver۪s license) that shows your name and Virginia address; or a current utility bill, bank statement, government check or paycheck that shows name and address; or another government document that shows name and Virginia address (for example a voter card).",
    "categories":["56e8415490336026d871856b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"how-often-do-i-need-to-apply-for-an-absentee-ballot-in-virginia",
    "name":"How often do I need to apply for an absentee ballot in Virginia",
    "text":"You'll need to apply separately for each election unless you are physically disabled or incapacitated by illness.If you're disabled or ill and likely to remain in this condition for the remainder of the calendar year, you can use apply to vote absentee by mail for all elections during the calendar year by completing the Parts A, B, C, and D of the <a href='/files/voter_forms/virginia-absentee-disabled-voters.pdf'>Virginia Annual Application for an Absentee Ballot due to Physical Disability or Illness.</a>Have your physician complete Part E of the Annual Application. Mail the completed application to your<a href='https://voterinfo.sbe.virginia.gov/PublicSite/Public/FT2/PublicContactLookup.aspx' style='text-decoration: underline; '>County (or City) Registrar</a>.You will be sent absentee ballots for all elections in which you are eligible to vote. In December of every year you will be sent another Annual Application to be completed in order to request ballots for the upcoming election year. This second Annual Application does not need the physician's statement since the first physician's statement will be on file already.",
    "categories":["56e8415490336026d871856b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-virginia",
    "name":"Can I vote in person before the election in Virginia",
    "text":"Yes. Check out our <a href='/early_voting_rules#virginia'>Early Voting</a> page for details.",
    "categories":["56e8415490336026d871856b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-connecticut",
    "name":"Do I need to provide ID when I register to vote in Connecticut",
    "text":"If you are registering for the first time in a Connecticut town, and you register by mail, then you must submit proof of your identity at the time of registration. The easiest way to meet the ID requirement is to write your Connecticut driver's license number or your Connecticut ID card number on your voter registration form. If you don't have either of these numbers, you can include a copy of one of the following forms of ID: A current and valid photo ID or a current utility bill, bank statement, government check, paycheck or other government document that shows your name and Connecticut address.",
    "categories":["56e84140c697911471461f71"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-with-my-absentee-ballot-in-connecticut",
    "name":"Do I need to provide ID with my absentee ballot in Connecticut",
    "text":"You do not need to provide ID with your absentee ballot if you've already voted in Connecticut at least once. If you are a first-time Connecticut voter you must submit a copy of your ID with your absentee ballot. Put the copy of your ID in the outer envelope. If you put the copy of your ID in the same envelope as your ballot, your ballot will be rejected. The following forms of ID are acceptable: a copy of a current and valid photo identification that shows your name OR a copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and Connecticut address.first-time outer envelope",
    "categories":["56e84140c697911471461f71"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i've-missed-the-absentee-ballot-application-deadline-is-there-anything-i-can-do",
    "name":"I've missed the absentee ballot application deadline. Is there anything I can do",
    "text":"In most cases, no. If you find yourself ill or hospitalized within six days of an election or referendum, you can apply for an emergency ballot using the <a href='/files/voter_forms/Connecticut_absentee_emergency.pdf'>Connecticut Emergency Absentee Ballot Application.</a> Mail the completed application to your <a href='http://www.ct.gov/sots/LIB/sots/ElectionServices/lists/TownClerkList.pdf'>Town Clerk</a>. You can ask for your ballot to be mailed to you, or you can designate a representative to pick it up.",
    "categories":["56e84140c697911471461f71"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-connecticut",
    "name":"Can I vote in person before the election in Connecticut",
    "text":"No, Connecticut does not allow in-person early voting.",
    "categories":["56e84140c697911471461f71"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-kentucky",
    "name":"Do I need to provide ID when I register to vote in Kentucky",
    "text":"Not strictly, no. But your identity needs to verified by an elections officer. Kentucky requires that election officers confirm the identity of each voter by personal acquaintance or by some document, such as a driver۪s license, social security card, credit card, or other identification card with a picture and a signature. If you can't provide sufficient proof of ID when you register, or if there's a dispute about your qualification to vote, you must sign a written oath before your vote can be cast.",
    "categories":["56e84145c697911471461f74"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-kentucky",
    "name":"Do I need to provide ID when I vote by absentee ballot in Kentucky",
    "text":"No. Kentucky won't issue an absentee ballot to anyone whose identity can't be verified. If you've received your absentee ballot, your identity has been verfied and you are clear to vote.",
    "categories":["56e84145c697911471461f74"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-need-an-emergency-absentee-ballot-in-kentucky-what-do-i-do",
    "name":"I need an emergency absentee ballot in Kentucky. What do I do",
    "text":"You can apply for a emergency absentee ballot if you experience a medical emergency during the 14 days before the election. Your spouse can also apply for an emergency absentee ballot on your behalf. Contact your Kentucky <a href='http://elect.ky.gov/contactcountyclerks/Pages/default.aspx' onclick='ga('send', 'event', 'OffsiteConversion','Click','Kentucky');' target='_blank'>County Clerk's Office</a> if you need an emergency absentee ballot.",
    "categories":["56e84145c697911471461f74"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-kentucky",
    "name":"Can I vote in person before the election in Kentucky",
    "text":"Yes. Check out our <a href='/early_voting_rules#kentucky'>Early Voting</a> page for details.",
    "categories":["56e84145c697911471461f74"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-nebraska",
    "name":"Do I need to provide ID when I apply for my absentee ballot in Nebraska",
    "text":"You do not need to provide ID if you've already voted in your county at least once. If you are a first-time voter in your county, and you you did not include a copy of your ID with your voter registration form, then you must include a copy with your absentee ballot application. You may include a copy of a current and valid photo identification that shows your name OR a copy of a current utility bill, bank statement, government check, paycheck or other government document that shows your name and Nebraska address.first-time voter in your county",
    "categories":["56e8414ac697911471461f7a"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"when-is-the-earliest-i-can-apply-for-an-absentee-ballot-in-nebraska",
    "name":"When is the earliest I can apply for an absentee ballot in Nebraska",
    "text":"All county election offices will accept Early Voting applications up to 120 days prior to a statewide Primary or General election. However, regular Early Voting ballots are not sent out or voted until 35 days before the Election.",
    "categories":["56e8414ac697911471461f7a"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-nebraska",
    "name":"Can I vote in person before the election in Nebraska",
    "text":"Yes. Check out our <a href='/early_voting_rules#nebraska'>Early Voting</a> page for details.",
    "categories":["56e8414ac697911471461f7a"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-oregon",
    "name":"Do I need to provide IDwhen I apply for my absentee ballot in Oregon",
    "text":"You do not need to provide a copy of your ID if you've already voted in Oregon at least once. If you are a first-time Oregon voter and did not include your Oregon driver's license number or Oregon state ID card number on your voter registration form, then you must include a COPY of one of the following documents with your absentee ballot request form: A valid photo identification OR a paycheck stub, utility bill, bank statement, or government document that shows your name and Oregon address.",
    "categories":["56e8414f90336026d8718566"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-oregon",
    "name":"Can I vote by absentee ballot on a permanent basis in Oregon",
    "text":"For the most part, yes. If your mailing address is in Oregon, simply register to vote using the <a href='/files/voter_forms/Oregon_voterreg_english.pdf'>Oregon Voter Registration Card</a> and indicate that your mailing address is different than your residence address. If your mailing address is outside of Oregon, you can use the <a href='/files/voter_forms/Oregon_absentee_english.pdf'>Oregon Absentee Ballot Request Form</a> to request all absentee ballots in a given calendar year.",
    "categories":["56e8414f90336026d8718566"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-at-all-in-oregon",
    "name":"Can I vote in person at all in Oregon",
    "text":"Nope. Oregon's voting is done 100% by mail.",
    "categories":["56e8414f90336026d8718566"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-washington",
    "name":"Do I need to provide IDwhen I vote by absentee ballot in Washington",
    "text":"You do not need to provide ID if you have already voted in Washington at least once. If you are voting for the first time in Washington and you did not provide adequate IDwhen you registered to vote, you need to include a copy of your ID with your absentee ballot application.Acceptable ID includes a valid photo ID such as a driver's license, state ID card, student ID card, or tribal ID card OR a current utility bill, bank statement, paycheck, government check or other current government document that shows your name and address. (If you have not met the identification requirements, you will be notified by mail that you need to provide identification.)",
    "categories":["56e84154c697911471461f81"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-washington",
    "name":"Can I vote by absentee ballot on a permanent basis in Washington",
    "text":"Absolutely. When you register to vote, you can indicate that your mailing address is different than your Washington residential address <a href='/files/voter_forms/Washington_voterreg_english.pdf'>Washington Voter Registration Form</a>. If you're already registered, use the<a href='https://wei.sos.wa.gov/agency/osos/en/Pages/myvote.aspx'>Washington MyVote tool</a>to change your mailing address.",
    "categories":["56e84154c697911471461f81"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-washington",
    "name":"Can I vote in person before the election in Washington",
    "text":"Yes. Although voting is done by-mail, voters can still vote in-person if they wish to do so. Check out our <a href='/early_voting_rules#washington'>Early Voting</a> page for details.",
    "categories":["56e84154c697911471461f81"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-iregister-to-vote-in-delaware",
    "name":"Do I need to provide IDwhen Iregister to vote in Delaware",
    "text":"If you registering for the first time in Delaware, and you register by mail, you MUST provide proof of your identification. If you don't include ID when you register, then you'll need to provide ID the first time you vote in person or by absentee ballot. Acceptable forms of ID include: a COPY of a current and valid photo identification OR a COPY of a current utility bill, bank statement, government check, paycheck or other government document that shows your name and Delaware address.first timeby mail",
    "categories":["56e8414090336026d8718554"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-delaware",
    "name":"Do I need to provide IDwhen I vote by absentee ballot in Delaware",
    "text":"You do not need to include ID if you've already voted in Delaware at least once. If you are a first-time Delaware voter, and you registered by mail, and you did NOT include a copy of your ID with your voter registration form, then you MUST include a copy with your absentee ballot application. Acceptable forms of ID include: a COPY of a current and valid photo identification OR a COPY of a current utility bill, bank statement, government check, paycheck or other government document that shows your name and Delaware address.",
    "categories":["56e8414090336026d8718554"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-delaware",
    "name":"Can I vote in person before the election in Delaware",
    "text":"Yes. Check out our <a href='/early_voting_rules#delaware'>Early Voting</a> page for details.",
    "categories":["56e8414090336026d8718554"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"warning-to-first-time-voters-in-louisiana:",
    "name":"Warning to First-Time Voters in Louisiana:",
    "text":"If you registered to vote <strong>by mail</strong>, you must vote <strong>in person the first time you vote</strong>. Exceptions to the first-time rule are:by mailin person the first time you vote<li>military or overseascitizens;</li><li>persons in the Senior Citizen or Disability Program;</li><li>students, who submit a copy of student ID or fee bill with the request;</li><li>citizens who appear in the registrar of voters office before the election to verify identity; and</li><li>participants in the state's address confidentiality program.</li>military or overseascitizens;persons in the Senior Citizen or Disability Program;students, who submit a copy of student ID or fee bill with the request;citizens who appear in the registrar of voters office before the election to verify identity; andparticipants in the state's address confidentiality program.",
    "categories":["56e84145c697911471461f75"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-louisiana",
    "name":"Do I need to provide ID when I register to vote in Louisiana",
    "text":"No, but Louisiana requires that photo ID from all voters, in-person and absentee. Acceptable forms of IDinclude a Louisiana driver's license, a Louisiana Special ID card, or other generally recognized picture identification card. If you do not have a picture ID card, you may sign an affidavit which will be attached to the precinct register, and you will be required to provide further identification as requested by the Commissioner at the polling place.",
    "categories":["56e84145c697911471461f75"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-louisiana",
    "name":"Do I need to provide ID when I vote by absentee ballot in Louisiana",
    "text":"Yes. If you submit your application by mail, you must also enclose a copy of a photo ID (Lousiana driver۪slicense, Louisiana special ID card or otherphoto IDwith your name and signature). If you are a disabled voter you may instead include a special <a href='/files/voter_forms/louisiana-disabled-voter-oath.pdf'>letter</a> listing the names and addresses of two persons residing inyour precinct who could make oath, if required, to the fact that you are physically disabled.",
    "categories":["56e84145c697911471461f75"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-louisiana",
    "name":"Can I vote in person before the election in Louisiana",
    "text":"Yes. Check out our <a href='/early_voting_rules#louisiana'>Early Voting</a> page for details.",
    "categories":["56e84145c697911471461f75"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-nevada",
    "name":"Do I need to provide ID when I register to vote in Nevada",
    "text":"If you're a first-time Nevada voter and you register to vote by mail, you'll need to include a COPY of your ID with your voter registration form. Acceptable forms of ID include: a current Nevada driver's license or Nevada state ID card that shows your name and address OR a copy of a current utility bill, bank statement, government check, rent receipt, paycheck, or government document that shows your name and Nevada address.If you forget, you'll need to show ID when you vote at the polls or you'll need to include ID with your absentee ballot application. ",
    "categories":["56e8414a90336026d871855f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-nevada",
    "name":"Do I need to provide ID when I vote by absentee ballot in Nevada",
    "text":"Only if you registered to vote by mail and you forgot to include a copy of your ID with your voter registration application. Acceptable forms of ID include: a current Nevada driver's license or Nevada state ID card that shows your name and address OR a copy of a current utility bill, bank statement, government check, rent receipt, paycheck, or government document that shows your name and Nevada address.",
    "categories":["56e8414a90336026d871855f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-nevada",
    "name":"Can I vote by absentee ballot on a permanent basis in Nevada",
    "text":"No, but you can apply for all elections during a single calendar year using one absentee ballot application.",
    "categories":["56e8414a90336026d871855f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-nevada",
    "name":"Can I vote in person before the election in Nevada",
    "text":"Yes. Check out our <a href='/early_voting_rules#nevada'>Early Voting</a> page for details.",
    "categories":["56e8414a90336026d871855f"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-pennsylvania",
    "name":"Do I need to provide ID when I register to vote in Pennsylvania",
    "text":"There are no special ID requirements for registering to vote. The standard form asks for either a PA driver's license number or the last four digits of your social security number; there is a box to check if you cannot provide either.",
    "categories":["56e84150c697911471461f7d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-pennsylvania",
    "name":"Do I need to provide ID when I vote by absentee ballot in Pennsylvania",
    "text":"Voters must provide drivers license number, last 4 digits of Social Security Number, or a copy of an accepted photo ID (listed below) when applying for an absentee ballot. You may provide this ID to <a class='ext' href='http://www.portal.state.pa.us/portal/server.ptopen=514&amp;objID=1174076&amp;parentname=ObjMgr&amp;parentid=60&amp;mode=2' target='_blank'>your county</a> over the phone, by email or mail. Your identity must be verified by the county board of elections before your ballot is counted. You have 6 days following an election to provide the necessary indentification. UOCAVA voters and voters affected by the Voting Accessibility for Elderly and Handicapped Act are exempt.Acceptable forms of ID must contain an expiration date that is current, unless noted otherwise. Accepted IDs include:<li>A photo ID issued by the U.S. Federal Government or the Commonwealth of Pennsylvania, including:<ul><li>a PA driver۪s license or non-driver۪s license photo ID (IDs are valid for voting purposes 12 months past expiration date), a valid U.S. passport, a U.S. military ID (active duty and retired military a military or veteran۪s ID must designate an expiration date or designate that the expiration date is indefinite), a military dependents۪ ID that contains an expiration date;</li></ul></li><li>An employee photo ID issued by Federal, PA, County or Municipal government;</li><li>A photo ID cards from an accredited Pennsylvania public or private institution of higher learning; or</li><li>Photo ID cards issued by a Pennsylvania care facility, including long-term care facilities, assisted living residences or personal care homes.</li>A photo ID issued by the U.S. Federal Government or the Commonwealth of Pennsylvania, including:<ul><li>a PA driver۪s license or non-driver۪s license photo ID (IDs are valid for voting purposes 12 months past expiration date), a valid U.S. passport, a U.S. military ID (active duty and retired military a military or veteran۪s ID must designate an expiration date or designate that the expiration date is indefinite), a military dependents۪ ID that contains an expiration date;</li></ul><li>a PA driver۪s license or non-driver۪s license photo ID (IDs are valid for voting purposes 12 months past expiration date), a valid U.S. passport, a U.S. military ID (active duty and retired military a military or veteran۪s ID must designate an expiration date or designate that the expiration date is indefinite), a military dependents۪ ID that contains an expiration date;</li>a PA driver۪s license or non-driver۪s license photo ID (IDs are valid for voting purposes 12 months past expiration date), a valid U.S. passport, a U.S. military ID (active duty and retired military a military or veteran۪s ID must designate an expiration date or designate that the expiration date is indefinite), a military dependents۪ ID that contains an expiration date;An employee photo ID issued by Federal, PA, County or Municipal government;A photo ID cards from an accredited Pennsylvania public or private institution of higher learning; orPhoto ID cards issued by a Pennsylvania care facility, including long-term care facilities, assisted living residences or personal care homes.",
    "categories":["56e84150c697911471461f7d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-pennsylvania",
    "name":"Can I vote by absentee ballot on a permanent basis in Pennsylvania",
    "text":"<font face='Verdana,Arial,Geneva' size='2'>Permanently sick or disabled voters may be placed on a list to automatically receive an absentee application prior to every election in which that voter is eligible to vote. Call your </font><a href='http://www.portal.state.pa.us/portal/server.ptopen=514&amp;objID=1174076&amp;parentname=ObjMgr&amp;parentid=60&amp;mode=2'>County Election Office</a> to learn more about permanent absentee voter status.Permanently sick or disabled voters may be placed on a list to automatically receive an absentee application prior to every election in which that voter is eligible to vote. Call your ",
    "categories":["56e84150c697911471461f7d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-need-an-emergency-pennsylvania-absentee-ballot-what-can-ido",
    "name":"I need an emergency Pennsylvania absentee ballot. What can Ido",
    "text":"If you have an emergency and did not apply for an absentee ballot by 5 p.m. on the Tuesday prior to Election Day, you may apply for an Emergency Absentee Ballot. This application must be notarized before it is submitted: <a href='/files/voter_forms/Pennsylvania_emergency_absentee.pdf'>Pennyslvania Emergency Absentee Ballot Application</a>.Emergency Absentee Ballot Applications must be submitted to your <a href='http://www.portal.state.pa.us/portal/server.ptopen=514&amp;objID=1174076&amp;parentname=ObjMgr&amp;parentid=60&amp;mode=2'>County Election Office</a> between 5 p.m. on the Tuesday before Election Day and 5 p.m. on the Friday before Election Day.<strong>How to obtain an Emergency Absentee Ballot if an emergency occurs after 5 p.m. on the Friday before Election Day: </strong>How to obtain an Emergency Absentee Ballot if an emergency occurs after 5 p.m. on the Friday before Election Day: If you become physically disabled or ill between 5:00 P.M. on the Friday before Election Day and 8:00 P.M. on Election Day - or if you find out after 5:00 P.M. on the Friday before Election Day that you will be absent from your municipality of residence on Election Day because of your business, duties or occupation - you must file an <a href='/files/voter_forms/Pennsylvania_emergency_absentee_after5pm.pdf'>Emergency Absentee Ballot Application</a> with the <a class='ext' href='http://www.pacourts.us/T/CommonPleas/DCAs.htm'>Court of Common Pleas</a> in the county where you are registered to vote.Your application must be submitted to the Court of Common Pleas no later than 8:00 P.M. on Election Day.If you are not able to appear in court to receive the ballot, you can designate, in writing, a representative to deliver the absentee ballot to you and return your completed absentee ballot to the county board of elections.<li>You must complete the <a href='/files/voter_forms/Pennsylvania_emergency_absentee_after5pm.pdf'>Emergency Absentee Ballot Application</a></li><li>You must also complete the <a href='/files/voter_forms/Pennsylvania_absentee_representative_authorization.pdf'>Authorization of Designated Representative Form</a></li><li>Your authorized representative must complete the <a href='/files/voter_forms/Pennsylvania_absentee_representative_certification.pdf'>Certification of Authorized Representative Form.</a></li>You must complete the <a href='/files/voter_forms/Pennsylvania_emergency_absentee_after5pm.pdf'>Emergency Absentee Ballot Application</a>You must also complete the <a href='/files/voter_forms/Pennsylvania_absentee_representative_authorization.pdf'>Authorization of Designated Representative Form</a>Your authorized representative must complete the <a href='/files/voter_forms/Pennsylvania_absentee_representative_certification.pdf'>Certification of Authorized Representative Form.</a>Your certified representative must deliver everything to the <a class='ext' href='http://www.pacourts.us/T/CommonPleas/DCAs.htm'>Court of Common Pleas</a> no later than 8pm on Election Day.If you are not able to appear in court or obtain assistance from an authorized representative, the judge will direct a deputy sheriff of the county to deliver the absentee ballot to you if you are at a physical location within the county.",
    "categories":["56e84150c697911471461f7d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-pennsylvania",
    "name":"Can I vote in person before the election in Pennsylvania",
    "text":"No, Pennsylvania does not allow in-person early voting.",
    "categories":["56e84150c697911471461f7d"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-west-virginia",
    "name":"Do I need to provide ID when I vote by absentee ballot in West Virginia",
    "text":"You do not need to provide ID if you've already voted in West Virginia at least once. If you are voting for the first time in West Virginia, you must include a copy of your ID with your application (unless you submitted it with your voter registration form).Acceptable forms of ID include acopy of a current and valid photo ID that shows your name and West Virginia address OR a copy of a current utility bill, bank statement, government check, paycheck or other government document that shows your name and West Virginia address.",
    "categories":["56e84155c697911471461f82"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-missed-the-absentee-ballot-deadline-does-west-virginia-offer-emergency-absentee-ballots",
    "name":"I missed the absentee ballot deadline. Does West Virginia offer emergency absentee ballots",
    "text":"You can apply for an emergency absentee ballot if you are hospitalized or admitted to a nursing home within <strong>seven days</strong> of the election. You or a family member must contact the County Clerk and request an emergency ballot. The <a href='https://apps.sos.wv.gov/elections/voter/index.aspx'>County Clerk</a> will deploy a team of emergency absentee voting commissioners to go to hospital or nursing home. This commissioners will bring the ballot to the hospital and will return the voted ballot to the <a href='https://apps.sos.wv.gov/elections/voter/index.aspx'>County Clerk</a>.seven days",
    "categories":["56e84155c697911471461f82"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-west-virginia",
    "name":"Can I vote in person before the election in West Virginia",
    "text":"Yes. Check out our <a href='/early_voting_rules#west_virginia'>Early Voting</a> page for details.",
    "categories":["56e84155c697911471461f82"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-florida",
    "name":"Do I need to provide ID when I register to vote in Florida",
    "text":"If you are a first-time Florida voter and you do not have an Florida driver's license number or Florida identification number, then you must include a copy of your ID with your voter registration form. If you don't, you'll need to provide ID the first time you vote in person or by absentee ballot. Acceptable forms of ID include: a copy of a photo ID that shows your name (U.S Passport, employee ID, buyers club ID, debit/credit card, military ID, student ID, retirement center ID, neighborhood association ID, public assistance ID); OR a copy of a current utility bill, bank statement, government check, paycheck, or government document that shows your name and Florida address. Elderly (65 years or old), disabled, overseas, and military voters are exempt from these ID requirements.",
    "categories":["56e8414190336026d8718555"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-florida",
    "name":"Do I need to provide ID when I vote by absentee ballot in Florida",
    "text":"You do not need to provide ID if you have already voted in Florida at least once. If you are a first-time Florida voter who registered by mail, and you did not include your Florida driver's license number or Florida identification card number on your voter registration form, then you must provide a copy of your identification with your absentee ballot application. Acceptable forms of ID include: a copy of a photo ID that shows your name (U.S.Passport, employee ID, buyers club ID, debit/credit card, military ID, student ID, retirement center ID, neighborhood association ID, public assistance ID) OR a copy of a currentutility bill, bank statement, government check, paycheck, or government document that shows your name and Florida address.first-timeby mailnot",
    "categories":["56e8414190336026d8718555"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-florida",
    "name":"Can I vote by absentee ballot on a permanent basis in Florida",
    "text":"Sort of. You can request an absentee ballot for a specific election, or you can submit one absentee ballot application for applications for the next regularly scheduled general election. (General elections take place in November of evenly numbered years: 2010, 2012, etc.) If you choose the second option, you will automatically receive an absentee ballot for every election in which you are eligible to vote through the next regularly scheduled general election.",
    "categories":["56e8414190336026d8718555"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i've-already-received-my-florida-absentee-ballot-can-i-still-vote-in-person",
    "name":"I've already received my Florida absentee ballot. Can I still vote in person",
    "text":"YES! You must bring your absentee ballot (voted or not) with you to the polls so it can be destroyed. If you forget the ballot, you'll have to vote a provisional ballot.",
    "categories":["56e8414190336026d8718555"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-florida",
    "name":"Can I vote in person before the election in Florida",
    "text":"Yes. Check out our <a href='/early_voting_rules#florida'>Early Voting</a> page for details.",
    "categories":["56e8414190336026d8718555"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-maine",
    "name":"Do I need to provide ID when I register to vote in Maine",
    "text":"If you are registering to vote for the first time in Maine, and you register to vote by mail, you must include a copy of your ID with your voter registration form. If you forget, you'll need to provide ID the first time you vote in person or by absentee ballot. If you never provide ID, you'll vote a provisional ballot. Acceptable identification includes: a current and valid driver۪s license or other photo ID that shows your Maine address OR a current utility bill, bank statement, paycheck, government check, or other government document that shows your name and Maine.first timeby mail",
    "categories":["56e8414690336026d871855b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-maine",
    "name":"Do I need to provide ID when I vote by absentee ballot in Maine",
    "text":"You do not need to provide ID if you've already voted in Maine at least once. If you're voting for the first time in Maine, and you did not include your ID with your voter registration form, you must include a copy with your absentee ballot application. Acceptable identification includes: a current and valid driver۪s license or other photo ID that shows your Maine address OR a current utility bill, bank statement, paycheck, government check, or other government document that shows your name and address.first time",
    "categories":["56e8414690336026d871855b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-maine",
    "name":"Can I vote in person before the election in Maine",
    "text":"Yes. Check out our <a href='/early_voting_rules#maine'>Early Voting</a> page for details.",
    "categories":["56e8414690336026d871855b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-iregister-to-vote-in-new-hampshire",
    "name":"Do I need to provide IDwhen Iregister to vote in New Hampshire",
    "text":"If you are a first-time New Hampshire voter then you must provide ID with your voter registration form. If you forget, you'll need to provide ID the first time you vote in person or by absentee ballot. Acceptable forms of ID include a copy of your driver's license or other photo identification that shows your name OR a copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and current address.",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-new-hampshire",
    "name":"Do I need to provide IDwhen I apply for my absentee ballot in New Hampshire",
    "text":"You do not need to include a copy of your ID if you are already registered to vote, or if you have already voted in New Hampshire at least once. <strong>If you are not yet registered to vote</strong>, you must include a copy of your ID with your absentee ballot application. Acceptable forms of ID include a copy of your driver's license or other photo identification that shows your name OR a copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and current address.If you are not yet registered to vote",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-new-hampshire",
    "name":"Can I vote in person before the election in New Hampshire",
    "text":"No, in-person early voting is not allowed in New Hampshire.",
    "categories":["56e8414d90336026d8718562"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-rhode-island",
    "name":"Do I need to provide ID when I register to vote in Rhode Island",
    "text":"You must provide either a valid Rhode Island driver's license number or valid Rhode Island ID number issued on your voter registration form. If you do not have a valid Rhode Island driver's license or RI ID number, you must provide the last 4 digits of your social security number. If you are registering for the first time in Rhode Island and you do not provide one of these numbers you'll have to include a copy of your ID. If you forget, you'll need to provide ID the first time you vote. Acceptable forms of identification include a copy of a current and valid photo identification OR a copy of a current utility bill, current bank statement, current government check, current paycheck, or Another current government document that shows your name and Rhode Island address.first time",
    "categories":["56e8415090336026d8718567"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-rhode-island",
    "name":"Do I need to provide IDwhen I apply for my absentee ballot in Rhode Island",
    "text":"You do not need to provide ID if you've already voted in Rhode Island at least once. If you are a first-time Rhode Island voter, and you did not put your driver's license number or state ID card number on your voter registration form, then you must provide a copy of one of the following with your absentee ballot application: a current and valid photo identification OR or a current utility bill, Current bank statement, Current government check, Current paycheck, or another current government document that shows your name and Rhode Island address.first-time",
    "categories":["56e8415090336026d8718567"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"ineed-an-emergency-absentee-ballot-help!",
    "name":"Ineed an emergency absentee ballot. Help!",
    "text":"If circumstances arise (such as hospitalization) within 20 days of the primary or election which prevent you from going to the polls to vote on election day, you may be eligible to vote an emergency mail ballot. <strong>The deadline to apply for an emergency ballot is 4:00 pm on the day before the election</strong>. You can request an emergency absentee ballot from your local <a href='http://www.elections.state.ri.us/canvassers/'>Board of Canvassers.</a> (NOTE:Rhode Island state law establishes the deadline to request a mail ballot as 4 p.m. the day prior to the election or primary. The Board of Elections is unable to accomodate any mail ballot requests after this deadline.)The deadline to apply for an emergency ballot is 4:00 pm on the day before the electionIf you apply for an emergency absentee ballot due to illness, disability or blindness, you must include a certificate from a physician or Christian Science practitioner. This certificate must contain the address of the physician or Christian Science practitioner, the date that the applI cant was last examined or treated and attest to the fact that the illness, disability, blindness or serious impairment of mobility did not manifest itself until twenty (20) days or less prior to the primary or election.All emergency ballot envelopes must be <strong>notarized or witnessed by 2 persons</strong> who must sign their names and addresses. (This requirement does not apply to military voters or voters who are incapacitated due to illness, disability, or blindness.)notarized or witnessed by 2 persons",
    "categories":["56e8415090336026d8718567"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-rhode-island",
    "name":"Can I vote by absentee ballot on a permanent basis in Rhode Island",
    "text":"Generally, no. However, if you are permanently incapacitated to the extent that it would be a hardship to go to the polling place, you may use the <a href='/files/voter_forms/RhodeIsland_absentee_disabled.pdf'>Rhode Island Application for Automatic Mail-in Ballot </a>to request that the Board of Canvassers put your name on their list to automatically receive a mail ballot application for a period of 5 years.",
    "categories":["56e8415090336026d8718567"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-rhode-island",
    "name":"Can I vote in person before the election in Rhode Island",
    "text":"No, Rhode Island does not allow in-person voting before election day.",
    "categories":["56e8415090336026d8718567"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i've-already-received-my-absentee-ballot-can-i-still-vote-in-person-in-rhode-island",
    "name":"I've already received my absentee ballot. Can I still vote in person in Rhode island",
    "text":"Yes, but only <strong>on election day</strong>.on election dayWhen you apply for a mail ballot, your Local Board of Canvassers makes a note of it and your name is taken off the list of eligible voters for your polling place. In order to be able to vote at the polling place, you must return the absentee ballot to the Board of Canvassers, or you will be required to cast a Provisional Ballot at the polling place on the day of the primary or election.",
    "categories":["56e8415090336026d8718567"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-wisconsin",
    "name":"Do I need to provide ID when I register to vote in Wisconsin",
    "text":"Yes. If you are registering to vote for the first time in Wisconsin, and you register by mail or you register in person during the 20 days preceding the election or at the polls on election day, you must submit '<strong>proof of residence</strong>' with your voter registration form.proof of residenceAcceptable forms of proof of residence includes any one of the following (submit a <strong>copy</strong> if you mail your registration): a current and valid Wisconsin driver's license; a current and valid Wisconsin I.D. card; any other official I.D. card or license issued by a Wisconsin governmental body or unit; any employer-issued photo I.D. card, issued in the normal course of business, but not including a business card; a university, college or technical college fee card or I.D. card with your photo and current address (May be used even if the card does not contain the cardholder's address, if the educational institution provides a certified student list for use at the polling place); a utility bill (e.g., gas, electric, cable TV or telephone) for the period commencing not earlier than 90 days before election day;a bank statement; a real estate (i.e., property) tax bill or receipt for the current year or the year preceding the date of the election; a pay check or a government check or other document issued by unit of government.copyPeople who register in person may also show a current residential lease which is effective for a period that includes election day.<strong> You may not use your lease if you register by mail. </strong> You may not use your lease if you register by mail. ",
    "categories":["56e84155c697911471461f83"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"<span-style=font-weight:-bold;\">do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-wisconsin</span>\"",
    "name":"<span style=font-weight: bold;\">Do I need to provide ID when I vote by absentee ballot in Wisconsin</span>\"",
    "text":"<strong>No.</strong>Just weeks before the 2014 election, the Supreme Court ruled Wisconsin's voter ID law unconstitutitional. Since this happened so close to the election, your absentee ballot instructions may tell you you need ID. <strong>But for the 2014 election, no ID is required.</strong>No.But for the 2014 election, no ID is required.",
    "categories":["56e84155c697911471461f83"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-wisconsin",
    "name":"Can I vote in person before the election in Wisconsin",
    "text":"Yes. Check out our <a href='/early_voting_rules#wisconsin'>Early Voting</a> page for details.",
    "categories":["56e84155c697911471461f83"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-Georgia",
    "name":"Do I need to provide ID when I register to vote in Georgia",
    "text":"First-time Georgia voters who register to vote by mail must show acceptable ID by mailing a copy of your identification with your voter registration application or providing a copy of your ID with your absentee ballot application. Acceptable forms of ID include a copy of a current and valid photo ID OR a copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and Georgia address.Military and overseas voters are exempt from this requirement.",
    "categories":["56e84141c697911471461f72"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-with-my-absentee-ballot-application-in-georgia",
    "name":"Do I need to provide ID with my absentee ballot application in Georgia",
    "text":"You do not need to provide ID if you have already voted in Georgia at least once. If you are voting for the first time and did not submit photo ID when you registered to vote, include one of the following forms of ID with your absentee ballot application: a copy of a current and valid photo ID OR a copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and Georgia address.Military and overseas voters are exempt from this requirement.",
    "categories":["56e84141c697911471461f72"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"how-often-do-i-need-to-apply-for-an-absentee-ballot",
    "name":"How often do I need to apply for an absentee ballot",
    "text":"You'll need to submit a separate application every time you wish to vote by absentee ballot unless you are in the military, 75 or older, or physically disabled.If you are in the military, 75 or older, or physically disabled, you can use one <a href='/files/voter_forms/Georgia_absentee_ballot.pdf'>Georgia Absente Ballot Application</a> to request an absentee ballot for the Primary, Primary Runoff (if applicable), Election and Election Runoff (if applicable). ",
    "categories":["56e84141c697911471461f72"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-georgia",
    "name":"Can I vote in person before the election in Georgia",
    "text":"Yes. Check out our <a href='/early_voting_rules#georgia'>Early Voting</a> page for details.",
    "categories":["56e84141c697911471461f72"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-maryland",
    "name":"Do I need to provide ID when I register to vote in Maryland",
    "text":"No, but first-time voters must provide ID before voting for the first time in person or by absentee ballot. If you'd like, you can submit your ID with your voter registration form instead. Acceptable forms of ID include: a copy of a current and valid photo ID, such as a Maryland driver's license; MVA-issued ID card; student photo ID card; or an employee photo ID. If you don't have a photo ID you can submit a copy of a current utility bill; bank statement; government check; paycheck or; other government document that shows the your name and address.",
    "categories":["56e8414690336026d871855c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-maryland",
    "name":"Do I need to provide ID when I vote by absentee ballot in Maryland",
    "text":"You do not need to provide ID if you have already voted in Maryland at least once. If are voting for the first time in Maryland, and you did not include ID with your voter registration application, you must include a copy of your ID with your absentee ballot application. Acceptable forms of ID include: a copy of a current and valid photo ID, such as a Maryland driver's license; MVA-issued ID card; student photo ID card; or an employee photo ID. If you don't have a photo ID you can submit a copy of a current utility bill; bank statement; government check; paycheck or; other government document that shows the your name and address.",
    "categories":["56e8414690336026d871855c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-return-my-voted-absentee-ballot-to-a-polling-place-in-maryland",
    "name":"Can I return my voted absentee ballot to a polling place in Maryland",
    "text":"Absolutely not. You must mail or hand deliver your voted ballot to your <a href='http://www.elections.state.md.us/about/county_boards.html'>County Board of Elections</a>. Do NOT take your voted absentee ballot to the polls on election day. A voted absentee ballot turned in at the polls will not be counted.",
    "categories":["56e8414690336026d871855c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"i-need-a-maryland-emergency-absentee-ballot-help!",
    "name":"I need a Maryland emergency absentee ballot. Help!",
    "text":"Mailed or faxed absentee ballot applications are due the Tuesday before the election. After this date, you may request an emergency absentee ballot if one of the following conditions arises:<li>Your job will prevent you from voting in person</li><li>You suffer a suddent illness or accident that prevents you from voting in person</li><li>An immediate member of your family passes away or suffers a serious illness</li>Your job will prevent you from voting in personYou suffer a suddent illness or accident that prevents you from voting in personAn immediate member of your family passes away or suffers a serious illnessRequests for emergency absentee ballots must be made in person at your <a href='http://www.elections.state.md.us/about/county_boards.html'>County Board of Elections</a>. You may designate an agent to pickup and, if necessary, return the voted ballot. If you have any questions about obtaining an emergency absentee ballot, please contact your <a href='http://www.elections.state.md.us/about/county_boards.html'>County Board of Elections</a>.in person",
    "categories":["56e8414690336026d871855c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"is-permanent-absentee-voter-status-available-in-maryland",
    "name":"Is permanent absentee voter status available in Maryland",
    "text":"Maryland does not have a permanent absentee list. If you wish to vote by absentee ballot, you must apply for an absentee ballot each primary and general election cycle.",
    "categories":["56e8414690336026d871855c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-maryland",
    "name":"Can I vote in person before the election in Maryland",
    "text":"Yes. Check out our <a href='/early_voting_rules#maryland'>Early Voting</a> page for details.",
    "categories":["56e8414690336026d871855c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-wyoming",
    "name":"Do I need to provide ID when I apply for my absentee ballot in Wyoming",
    "text":"You do not need to provide ID if you have already voted in Wyoming at least once. If you are a first time Wyoming voter, and you did not include your ID with your voter registration form, you must include a copy of your ID with your absentee ballot application.Acceptable forms of ID include: <strong>One of the following</strong>: a driver's license from any state; an ID card issued by a local, state or federal agency; a US passport; a school ID; or a military ID; or <strong>Two of the following</strong>: Certification of US Citizenship; Certificate of Naturalization; Draft Record; voter registration card from another state or county; original or certified copy of a birth certificate bearing an official seal; certification of birth abroad issued by the Department of State; or any other form of identification issued by an official agency.One of the followingTwo of the following",
    "categories":["56e8415690336026d871856c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"when-is-the-earliest-I can-apply-for-my-absentee-ballot-in-wyoming",
    "name":"When is the earliest I can apply for my absentee ballot in Wyoming",
    "text":"You may apply for an absentee ballot at any time during the calendar year in which the election is held, except on election day.",
    "categories":["56e8415690336026d871856c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "slug":"can-i-vote-in-person-before-the-election-in-wyoming",
    "name":"Can I vote in person before the election in Wyoming",
    "text":"Yes. Check out our <a href='/early_voting_rules#wyoming'>Early Voting</a> page for details.",
    "categories":["56e8415690336026d871856c"],
    "type":"html"
  }
]