[
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Do I need to provide ID when I register to vote in New Mexico",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-new-mexico",
    "text":"Yes. If you register by mail, you must include a <strong>copy</strong> of your identification with your voter registration application. If you forget, you'll need to provide ID the first time you vote in person or by absentee ballot.by mailcopyAcceptable forms of ID include:a current and valid photo identification with or without an address (the address does not need to match the one at which you registered to vote) OR a utility bill, bank statement, government check, paycheck, student identification card or other government document, including identification issued by an Indian nation, tribe or pueblo, that shows your name and address (the address does not need to match the one at which you're registering to vote).",
    "categories":["56e8414c90336026d8718561"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Do I need to provide ID when I vote by absentee ballot in New Mexico",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-new-mexico",
    "text":"You do not need to include ID if you've already voted in New Mexico at least once. If you are a first-time voter and you forgot to include copies of your ID with your registration form, include them with your absentee ballot application.<strong>First-time voters who are voting absentee:</strong> If you don't meet the voter ID requirements when you register to vote, you'll be notified by mail and you will need to provide a copy of your identification with your absentee ballot.Acceptable forms of ID include: a current and valid photo identification with or without an address (the address does not need to match the one at which you registered to vote) OR a utility bill, bank statement, government check, paycheck, student identification card or other government document, including identification issued by an Indian nation, tribe or pueblo, that shows your name and address (the address does not need to match the one at which you're registering to vote).First-time voters who are voting absentee:",
    "categories":["56e8414c90336026d8718561"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Can I change my mind after I receive my absentee ballot and vote in person on election day in New Mexico",
    "slug":"can-i-change-my-mind-after-i-receive-my-absentee-ballot-and-vote-in-person-on-election-day-in-new-mexico",
    "text":"No. Once you receive your absentee ballot, you cannot change your mind and vote in person on election day.However, if you applied but never received your absentee ballot, you can go to your polling place and vote. You will be required to sign a sworn statement, under penalty of perjury, that you did not receive your ballot.",
    "categories":["56e8414c90336026d8718561"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Can I vote in person before the election in New Mexico",
    "slug":"can-i-vote-in-person-before-the-election-in-new-mexico",
    "text":"Yes. Check out our <a href='/early_voting_rules#new_mexico'>Early Voting</a> page for details.",
    "categories":["56e8414c90336026d8718561"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Do I need to provide ID when I register to vote in New Jersey",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-new-jersey",
    "text":"You must include your New Jersey driver's license number or your non-driver ID number on your voter registration form. If you don't have either of these numbers, you must include a copy of your ID with your form. If you forget, you'll need to provide ID the first time you vote in person or by absentee ballot. Acceptable forms of ID include: a driver's license or other photo identification that shows your name and New Jersey address OR a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and New Jersey address.",
    "categories":["56e8414cc697911471461f7b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Do I need to provide ID when I vote by absentee ballot in New Jersey",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot-in-new-jersey",
    "text":"You'll only need to provide ID if you didn't meet the voter ID requirements when you registered to vote. If you're a first-time voter and you didn't include your New Jersey drivers licence number on your voter registration form, then you should include a COPY of a current and valid photo ID that shows your name OR a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and New Jersey address.",
    "categories":["56e8414cc697911471461f7b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"I missed the absentee ballot application deadline in New Jersey. Is there anything I can do",
    "slug":"i-missed-the-absentee-ballot-application-deadline-in-new-jersey-is-there-anything-i-can-do",
    "text":"General not. Emergency Absentee Ballots are available on election day only for voters who've become ill on election day or during the night before election day. Contact your <a href='http://www.state.nj.us/state/elections/voting-information-local-officials.html'>County Clerk</a> if you have questions about emergency absentee ballots.",
    "categories":["56e8414cc697911471461f7b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Can I vote by absentee ballot on a permanent basis in New Jersey",
    "slug":"can-i-vote-by-absentee-ballot-on-a-permanent-basis-in-new-jersey",
    "text":"You can use the <a href='/files/voter_forms/NewJersey_absentee_english.pdf'>New Jersey Absentee Ballot Application</a> to put yourself on a permanent absentee voter list. You can request all elections in the current calendar year, all future November general elections, or both. (The general elections take place in even number years - 2010, 2012, etc - and include the presidential and congressional elections.) It's best to submit a new application <strong>every January</strong> to ensure that you'll receive an absentee ballot for all elections in which you are eligible to vote. every January",
    "categories":["56e8414cc697911471461f7b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"I've already received my absentee ballot in New Jersey. Can I change my mind and vote in person",
    "slug":"i've-already-received-my-absentee-ballot-in-new-jersey-can-i-change-my-mind-and-vote-in-person",
    "text":"No. Once you apply for an absentee ballot, you must vote by absentee ballot. You cannot change your mind and vote in person.",
    "categories":["56e8414cc697911471461f7b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Can I vote in person before the election in New Jersey",
    "slug":"can-i-vote-in-person-before-the-election-in-new-jersey",
    "text":"No. In-person early voting is not allowed. No. ",
    "categories":["56e8414cc697911471461f7b"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Do I need to provide ID when I register to vote in New Hampshire",
    "slug":"do-i-need-to-provide-id-when-i-register-to-vote-in-new-hampshire",
    "text":"If you are a first-time New Hampshire voter then you must provide ID with your voter registration form. If you forget, you'll need to provide ID the first time you vote in person or by absentee ballot. Acceptable forms of ID include a copy of your driver's license or other photo identification that shows your name OR a copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and current address.",
    "categories":["56e8414b90336026d8718560"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Do I need to provide ID when I apply for my absentee ballot in New Hampshire",
    "slug":"do-i-need-to-provide-id-when-i-apply-for-my-absentee-ballot-in-new-hampshire",
    "text":"You do not need to include a copy of your ID if you are already registered to vote, or if you have already voted in New Hampshire at least once. <strong>If you are not yet registered to vote</strong>, you must include a copy of your ID with your absentee ballot application. Acceptable forms of ID include a copy of your driver's license or other photo identification that shows your name OR a copy of a current utility bill, bank statement, government check, paycheck, or other government document that shows your name and current address.If you are not yet registered to vote",
    "categories":["56e8414b90336026d8718560"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Can I vote in person before the election in New Hampshire",
    "slug":"can-i-vote-in-person-before-the-election-in-new-hampshire",
    "text":"No, in-person early voting is not allowed in New Hampshire.",
    "categories":["56e8414b90336026d8718560"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"I missed the voter registration deadline for North Carolina. What can I do",
    "slug":"i-missed-the-voter-registration-deadline-for-north-carolina-what-can-i-do",
    "text":"A North Carolina resident who is qualified to vote but who misses the 25-day deadline for voter registration may register and vote in person before election day at an Early Voting Site. If you do this, you must vote at the Early Voting Site during the early voting period; you cannot vote by mail or at the polls on election day. See our <a href='/early_voting_rules#north_carolina'>Early Voting</a> page for more information.",
    "categories":["56e8414dc697911471461f7c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Do I need to provide ID when Iapply for my absentee ballot in North Carolina",
    "slug":"do-i-need-to-provide-id-when-iapply-for-my-absentee-ballot-in-north-carolina",
    "text":"You do not need to provide ID if you've already voted in North Carolina at least once. If you are voting for the first time in North Carolina and you did not meet the ID requirements when you registered to vote, then you must include a COPY of a current and valid photo ID that shows your name OR a current utility bill, bank statement, government check, paycheck or other government document that shows your name and North Carolina address.first time",
    "categories":["56e8414dc697911471461f7c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Long Distance Voter has created custom absentee ballot application forms for other states, why not North Carolina",
    "slug":"long-distance-voter-has-created-custom-absentee-ballot-application-forms-for-other-states,-why-not-north-carolina",
    "text":"We made a North Carolina absentee ballot application, but we were informed by the State Board of Elections that it is against state law for a third party (such as Long Distance Voter) to create and distribute absentee ballot applications. The state isn't being malicious, but they are concerned about outside influence on elections.We think the best solution at this point is for the State Board of Elections to create their own formal absentee ballot application and to make it available on their website. If you agree with us - and we bet you do - <strong>call the State Board of Elections and ask them to create a formal statewide absentee ballot application.</strong> Here are their phone numbers:(919) 733-7173or (866) 522-4723.call the State Board of Elections and ask them to create a formal statewide absentee ballot application.",
    "categories":["56e8414dc697911471461f7c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Can I vote in person before the election in North Carolina",
    "slug":"can-i-vote-in-person-before-the-election-in-north-carolina",
    "text":"Yes. Check out our <a href='/early_voting_rules#north_carolina'>Early Voting</a> page for details.",
    "categories":["56e8414dc697911471461f7c"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Do I need to provide ID with my voter registration form in South Carolina",
    "slug":"do-i-need-to-provide-id-with-my-voter-registration-form-in-south-carolina",
    "text":"South Carolina requires all applicants to include their full Social Security number on their voter registration forms. This number is used to make sure that one person has not registered multiple times. If you are registering for the first time in your county, you MUST attach a copy of a current and valid photo identification OR a copy of a current utility bill, bank statement, paycheck or other government document that shows your name and South Carolina address. If you do not provide your ID, you'll have to provide it the first time you vote.first time",
    "categories":["56e8415190336026d8718568"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Do I need to provide ID when I vote by absentee ballot",
    "slug":"do-i-need-to-provide-id-when-i-vote-by-absentee-ballot",
    "text":"If you are a first-time South Carolina voter and you registered to vote by mail, you should provide a copy of your ID with your absentee ballot application. If you forget, you'll need to include it with your absentee ballot. Acceptable forms of ID include a current and valid photo ID OR a copy of a current utility bill, bank statement, paycheck or other government document that shows your name and South Carolina address. If you never provide ID, you're ballot will be considered a provisional ballot, which means it might not be counted.If you are a first-time South Carolina voter and you registered to vote in person you do not need to provide additional ID with your absentee ballot.If you have already voted in South Carolina , either in person or by absentee ballot, you do not need to provide ID during the absentee voting process.",
    "categories":["56e8415190336026d8718568"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"I need an emergency absentee ballot for South Carolina. Help!",
    "slug":"i-need-an-emergency-absentee-ballot-help-for-south-carolina",
    "text":"The deadline to apply for a regular absentee ballot is four days before an election. Voters admitted to the hospital as an emergency patient on the day of the election or within four days of the election can have an immediate family member apply and carry a ballot to the voter. Contact your South Carolina<a href='http://www.scvotes.org/county_election_commission_information'>county election commission/voter registration office</a> for information on how to obtain an emergency absentee ballot.",
    "categories":["56e8415190336026d8718568"],
    "type":"html"
  },
  {
    "collectionId":"56e35a51c697911471461343",
    "status":"published",
    "name":"Can I vote in person before the election in South Carolina",
    "slug":"can-i-vote-in-person-before-the-election-in-south-carolina",
    "text":"Yes. Check out our <a href='/early_voting_rules#south_carolina'>Early Voting</a> page for details.",
    "categories":["56e8415190336026d8718568"],
    "type":"html"
  }
]